{
  "2021-JDR": "1. Introduction De nos jours, la technologie informatique permet de stocker et de traiter pratiquement toutes les informations susceptibles d'intéresser une organisation. Cependant les utilisateurs ne contrôlent pas souvent la manière dont leurs données personnelles sont collectées, stockées et traitées. Le règlement général sur la protection des données (RGPD), entré en vigueur en mai 2018, constitue une étape importante dans la direction de la protection des données personnelles (EU, 2016). Le but du RGPD est de protéger les citoyens de l'UE contre les atteintes à la vie privée de leurs données personnelles. Le RGPD contrôle la manière dont les organisations traitent les informations personnelles de leurs clients et accorde aux individus des droits de protection renforcés en ce qui concerne ces données. Les organisations non conformes au RGPD doivent faire face à de lourdes sanctions. Le RGPD présente un impact majeur sur la plupart des processus métiers des entreprises dès sa mise en œuvre. Les entreprises sont tenues de mettre en œuvre correctement les politiques de gestion des données du RGPD et de prendre les mesures appropriées sur les données lorsque leurs clients le demandent. La conception et le développement des nouveaux systèmes d’information ainsi que l’évolution des systèmes déjà existants vers la conformité aux normes RGPD est un enjeu important pour les entreprises d’aujourd’hui. En ingénierie des SI, des solutions peuvent être apportées par un ensemble de domaines différents. Dans ce travail, nous allons nous concentrer sur un seul domaine - celui de la Gestion des Processus Métier (BPM). Les entreprises adoptent de plus en plus les systèmes de gestion de processus métiers (BPMS) afin de gérer leurs activités et la gestion des données. Ainsi, pour atteindre la conformité au RGPD, les organisations doivent remodeler leur approche de la gestion des données personnelles stockées et échangées lors de l'exécution de leurs processus métiers. Bien que la modélisation des processus métier soit bien adaptée pour exprimer la collaboration des parties prenantes et les données échangées entre les activités des processus métier et les participants, il y a peu d’études concernant la conformité du RGPD et l’identification des violations potentielles de la vie privée dans le cycle de vie d’un processus métier. Dans cette revue systématique de la littérature (SLR) nous analysons les solutions/approches évoquées par la communauté scientifique pour la mise en conformité des processus métiers au RGPD. Les objectifs sont de (i) examiner les recherches actuelles concernant l'intégration du RGPD dans les pratiques de gestion de processus métier et notamment dans les différentes phases de cycle de vie d’un processus métier et (ii) identifier les lacunes de la recherche actuelle afin de suggérer des domaines à approfondir. L’article est organisé de la manière suivante. La section 2 donne une définition des éléments clés de cette revue. La section 3 présente le protocole de recherche utilisé. La section 4 présente les résultats de l’analyse. Nous discuterons les résultats obtenus dans la section 5 et conclurons dans la section 6. 2. Définition des Termes Clés Le règlement général sur la protection des données est la nouvelle loi de l'Union européenne pour la protection des données personnelles. Le RGPD définit les données à caractère personnel comme toute information relative à une personne physique identifiée ou identifiable (“personne concernée”). Cela signifie qu'une personne concernée est une personne physique (un être humain vivant) dont les données sont gérées par un responsable du traitement (EU, 2016). Depuis 2018, le nouveau règlement a pour objectif de renforcer les droits des individus sur leurs propres données ainsi que de rendre les organisations plus responsables. Il contribue à l'harmonisation des précédentes lois fragmentées sur la protection des données à travers l'UE, afin d'assurer une protection égale des droits de l'Homme des citoyens européens. Le RGPD définit les principes suivants concernant les données et leurs traitements : la transparence (les données doivent être traitées de manière équitable, licite et transparente) ; la pertinence (les données ne devraient être collectées qu'à des fins déterminées, explicites et légitimes, et non traitées ultérieurement à d'autres fins) ; la minimisation (les données traitées doivent être pertinentes, adéquates et limitées à ce qui est nécessaire au regard des finalités pour lesquelles elles sont traitées) ; la précision (les données traitées doivent être exactes et régulièrement mises à jour) ; la conservation (les données doivent être supprimées après une période limitée) ; le consentement explicite (les données ne peuvent être collectées et traitées que si la personne donne son consentement explicite). Les processus métiers se réfèrent généralement à toute collection structurée d'activités ou de tâches connexes effectuée pour atteindre les objectifs visés d'une organisation. Il peut être structuré en un ou plusieurs ensembles définis d'activités qui représentent les étapes nécessaires pour atteindre des objectifs relatifs aux affaires, y compris les flux et utilisations d'informations et de ressources. La gestion des processus métier (BPM) comprend des concepts, des méthodes et des techniques pour prendre en charge la conception, l'administration, la configuration, la mise en œuvre et l'analyse des processus métier (Weske 2010). Le cycle de vie d’un processus métier, selon BPM, est composé de 4 étapes principales : le Design (phase de modélisation où l’on réfléchit sur comment modéliser le processus métier de manière informatique afin qu’il représente de manière le plus fidèle possible la réalité), la Configuration (phase de l’implémentation où l’on met en œuvre une solution de Business process management (BPM) reliée au système d’information de l’entreprise), l’Exécution (phase opérationnelle où la solution de BPM est mise en œuvre) et l’Évaluation (phase d’analyse de l’état des BPMN processus à travers des logs, tableaux de bord détaillant la performance, etc). (www.omg.org) est le formalisme de représentation des processus métiers qui est la norme de facto pour la modélisation des processus. Il s'agit d'un langage riche et expressif utilisé pour les tâches associées à la modélisation des processus. 3. Protocole de Recherche Nous avons effectué une revue systématique de littérature (Brereton et al., 2007), (Levy et Ellis, 2006). La réforme du RGPD est un sujet récent, ici nous examinons comment ce sujet est intégré par la communauté de recherche BPM au travers des outils, méthodes, théories et leurs applications dans la pratique. Nous nous sommes basées sur la méthodologie proposée par (Kichenham et Charters, 2007). 3.1. Planification et définition de questions de recherche Cette étude vise à examiner les récentes méthodes et solutions pour la conformité des processus métiers au RGPD. Il faut savoir qu’il n’existe aujourd’hui aucune pratique standardisée du RGPD. Il est exigé que les entreprises fournissent un niveau de protection de données personnelles raisonnable mais il n’y a pas d’exigence détaillée sur la manière dont les organisations doivent mettre en œuvre le RGPD au sein de leurs processus métiers. Ainsi, les organisations doivent elles-mêmes évaluer leurs processus métiers et mettre en œuvre un plan d’action pour s’y conformer. La question de recherche centrale (QR) est la suivante. QR : Comment la communauté scientifique BPM envisage la conformité des processus métiers aux RGPD ? Nous avons développé notre étude afin de répondre aux sous-questions plus spécifiques : QR1 : La gestion des processus métiers offre-t-elle un ensemble suffisant de méthodes et outils pour assurer la conformité au RGPD dans les organisations ? et QR2 : A quelles étapes du cycle de vie d’un processus métier interviennent les impacts de la conformité au RGPD ? De plus, nous avons examiné séparément les impacts du RGPD sur la conception de nouveaux processus (avec un objectif d'intégrer les normes RGPD “by design”) et sur l'évolution des processus existants (avec un objectif d'établir la conformité aux normes plus tard dans leurs cycle de vie), ceci nous a permis de définir deux autres sous-questions : QR3 : Comment les praticiens intègrent le RGPD dans les processus métiers existants ? et QR4 : Comment les normes RGPD sont intégrées à la conception du processus ? 3.2. Étude de Sources bibliographiques Nous avons choisi de suivre la méthode de recherche proposée par (Zhang et al., 2011) qui consiste à définir les termes et les chaînes de recherches pour la recherche automatique via les différents moteurs de recherche. Par la suite, nous avons complété par une recherche manuelle. En complétant et en évaluant dans les deux sens la recherche manuelle et la recherche automatique, il a été possible de définir un ensemble de publications pertinentes sur lesquelles nous avons effectué la technique nommée « effet boule de neige » qui repose sur les différentes références que les auteurs ont utilisées dans les publications qui constituent notre revue de littérature. 3.2.1. Recherche automatique Les mots clefs utilisés pour la recherche reprennent les termes de “RGPD” et “Business process” avec certains synonymes de ce dernier comme “BP”, “workflow”, “workflow system”, “Business Process System”, “BPM”, “Business process management”. Nous avons utilisé quatre bases de données en ligne parmi les plus connues et représentatives du domaine en utilisant des chaînes de recherche à partir des syntaxes et des règles définies : IEEE Xplore, ACM Digital Library, SpringerLink et ScienceDirect (cf Tableau 1). Nous avons ensuite établi une liste de critères à respecter pour chacun des articles à conserver pour notre étude, soit en critères d’inclusion, soit en critères d’exclusion. Tableau 1. Résultat de la recherche automatique Sources Requêtes Résultat SpringerLink (\"GDPR\" OR \"General Data Protection Regulation\") AND (\"Business 145 process\" OR \"Business process system\" OR \"BPM\" OR \"BP\") IEEE (((\"Document Title\":GDPR) OR (\"Abstract\":GDPR)) AND 456 XPLORE ((\"Abstract\":Business process) OR (\"Document Title\":Business process)) OR ((\"Abstract\":BPM) OR (\"Document Title\":BPM))) ACM [Publication Title: gdpr] AND [Abstract: business process] AND 667 DIGITAL [Abstract: business process management] AND [Abstract: general data protection regulation] ScienceDirect (\"GDPR\" OR \"General Data Protection Regulation\") AND (\"Business 130 process\" OR \"Business process system\" OR \"Business Process Management\" OR \"BP\") Critères d’inclusion : la source (a) est un article de recherche ou conférence et accessible en ligne, (b) est en anglais, (c) le titre ou le résumé est conforme aux chaînes de recherche définie, (d) fait partie des bases de données définies ci-dessus et (e) comporte une réponse de conformité RGPD au processus métier. Tableau 2. Résultat de la recherche manuelle Etapes Description de l’étape Nombre d’articles Recherche Elaboration de la liste des sources de recherche et des SpringerLink : 145 requêtes de recherches IEEE XPLORE : 456 automatique ACM Digital : 667 Science Direct : 130 Premier filtrage Application des critères d’inclusions et d’exclusions, 40 puis lecture des articles un à un (abstract, titre et mots-clefs) pour établir le QGS. Recherche « boule de Méthodes de Snowballing : on se base sur les 51 : [1] - [51] différentes références que les auteurs ont utilisées neige » dans les publications qui constituent notre QGS. Critères d’exclusion : la source (a) n’est pas un article scientifique (article de Blog, Magazine ou Journal grand public), (b) est antérieure à 2005, (c) ne comporte pas de résumé, (d) est une étude dupliquée et (e) s’intéresse à la conformité du RGPD sans évoquer de solutions répondant aux problèmes pour les processus métiers. 3.2.2. Recherche manuelle Une fois la sélection terminée, tous ces articles identifiés sont utilisés pour former le quasi-gold standard. A partir de celui-ci, nous allons effectuer la méthode de l’effet boule de neige pour étendre notre bibliographie. Suite au protocole de recherche défini, nous avons établi une liste de 51 articles afin d’effectuer notre analyse. Pour la simplicité de présentation, nous avons regroupé ces articles dans la première partie de notre bibliographie et ajouté un index numérique. 4. Extraction et Analyse des Données Nous examinons ici l’ensemble des 51 articles sélectionnés afin de caractériser la recherche de manière quantitative et qualitative. Nous avons extrait et exploité les données sur la date de publication, le thème principal, le type de recherche et le rapport avec une étape spécifique du cycle de vie du processus selon BPM. Figure 1 : Distribution des articles examinés par année de publication La Figure 1 illustre la distribution des articles selon leur année de publication. Cette distribution démontre que l'intérêt par rapport aux problématiques de traitement de données personnelles dans le BPM a été exprimé avant l'apparition officielle du RGPD. Le nombre croissant de publications ces 3 dernières années démontre que la conformité au RGPD est un problème traité par la communauté BPM. 4.1. Classifications des articles selon des thèmes Nous avons procédé à une lecture des articles sélectionnés et nous avons identifié 6 thèmes principaux (certains articles peuvent étudier plusieurs thèmes): Modélisation : Ce thème comprend tous les articles présentant une méthode de modélisation, un outil de modélisation ou une proposition de modèle pour la conformité d’un processus métier au RGPD. En effet, il peut s’agir d’un outil de modélisation, de modèles existants sur le RGPD ou bien de modèles d’aide à l’élaboration de processus métiers. Langage : Ce thème comprend principalement le langage BPMN et son évolution pour répondre à la conformité du RGPD. Ce thème comprend également les articles évoquant des langages permettant de rendre un modèle de processus conforme au RGPD. Évaluation : Ce thème correspond à l’utilisation de méthodes et outils permettant d’évaluer les systèmes d’information des entreprises et les données afin d’élaborer des processus métiers conformes aux RGPD. Exigences : Ce thème comprend toutes techniques et outils permettant de définir les exigences en lien avec le RGPD. Contrôle : Ce thème comprend les méthodes et outils permettant de faire des contrôles sur les processus existants. Exploration : Ce dernier thème comprend principalement les méthodes de fouille de processus au service du RGPD et des processus métiers. Figure 2 : Résultat de la classification par thème. D'après nos résultats, le thème comportant le plus d'articles est « Modélisation » (22 articles). Plusieurs articles évoquent des solutions ou méthodes de modélisation (autres que BPMN) visant la conformité des PM aux RGPD. Certains articles proposent des modèles de conceptions de PM propres à chaque contrainte du RGPD. D’autres articles proposent des modèles UML ou modèles de conception d’aide à la modélisation - des modèles représentant les différentes contraintes du RGPD pour une meilleure compréhension des relations des diverses contraintes. « Langages » est le deuxième thème le plus évoqué (17 articles). Une majorité d'articles évoque la conformité des processus métiers au RGPD via l’évolution du BPMN. BPMN est le formalisme le plus couramment utilisé pour représenter les processus métiers. BPMN est conçu pour être un langage extensible, il peut être utilisé pour créer des extensions pour de nouveaux artefacts dans les diagrammes BPMN. Un large nombre d'articles propose des solutions d’extensions de BPMN pour représenter les tâches liées à la protection des données. La deuxième solution la plus évoquée dans ce thème vise à intégrer le modèle juridique du RGPD dans un processus métier. Par exemple, le modèle DAPRECO [25][32][38] propose un formalisme et définit un référentiel de règles RGPD écrites en LegalRuleML - un standard pour représenter le contenu sémantique et logique des documents juridiques. « Exploration », « Évaluation » et « Exigences » sont représentés par 6 articles chacun. Ces 3 thèmes présentent des solutions évoquées dans la mise à place de la conformité au RGPD des processus métiers. Concernant l'exploration, les solutions évoquées concernent la méthode de la fouille de processus. En effet, il s’agit d’explorer les logs des processus métiers pour viser la conformité du RGPD. Pour le thème de l’évaluation, les articles évoquent des méthodes d'évaluation des systèmes d’information par les acteurs afin d’élaborer des PM adaptés aux contraintes du RGPD. Et enfin le dernier thème concerne les exigences et les articles évoquent plus précisément les exigences de sécurité et de confidentialité En effet, les articles proposent des méthodes afin d’analyser ses exigences pour une meilleure compréhension de celles-ci afin de permettre une conception de PM plus efficace. Le thème le moins évoqué par notre liste de sources est le thème du « Contrôle » (4 articles). Les seuls contrôles proposés concernant les processus métiers existants concernent les contrôles d’accès et d’habilitation afin d’effectuer des contrôles sur chaque activité exécutée. Tableau 3. Analyse selon le thème Thème Articles du SLR Modélisation [1][3][4][5][7][8][11][13][14][15][17][22][23][24][26][31][32][33][42][44][47][48] Langage [1][2][5][6][14][19][21][30][35][36][37][38][39][40][42][43][47] Évaluation [2][4][18][25][34][45] Exigences [10][15][27][28][37][46] Contrôle [12][16][33][41] Exploration [9][20][29][49][50][51] 4.2. Classification des articles selon le type de recherche Nous avons établi 3 types d’articles selon le type de recherche utilisée : Recherche théorique : Ce type d’article a pour objectif d’établir une problématique ou question de recherche afin d’y répondre en déterminant les concepts clefs, les théories et les idées préexistantes en lien avec le sujet choisi sans proposer de solutions pratiques. Recherche proposant une solution sans validation empirique : Ce type d’article consiste en une proposition de solutions à un problème ou question de recherche défini sans validation empirique c’est-à-dire aucune preuve d’observation ou d’expérimentation pour la solution proposée. Recherche proposant une solution avec validation empirique : par ce type, nous avons regroupé les articles proposant une solution à un problème ou question de recherche défini avec une validation/preuve empirique (des exemples de cas pratiques, des expérimentations sont évoqués dans les articles). Figure 3. Résultat de la classification par type de recherche Des “recherches proposant une solution avec validation empirique” sont présentées dans 27 articles. Parmi les travaux examinés, un grand nombre d'articles proposent des solutions pour la conformité des processus métiers au RGPD avec des preuves empiriques. Ces preuves sont principalement des démonstrations suite à des observations/expérimentations ou des validations par les pairs. Ces articles sont également accompagnés de cas pratiques pour démontrer les solutions proposées. Ainsi, ils proposent non seulement un aspect théorique avec une approche ou méthodologie bien définie mais également un aspect pratique en démontrant la mise en œuvre de leurs solutions et analysant les observations et résultats obtenus. Tableau 4. Analyse selon le type de recherche Type Articles du SLR Recherche théorique [13][25][29][32][34][38][41][46] Recherche proposant une solution [1][3][8][10][14][15][17][21][22][27][31][33][39][44][45][50] sans validation empirique Recherche proposant une solution [2][4][5][6][7][9][11][12][16][18][19][20][23][24][26][28][30][35] avec validation empirique [36][37][40][42][43][47][48][49][51] 4.1.3. Classification selon l’étape du cycle de vie d’un Processus Métier (d'après BPM) 16 articles présentent des “recherches proposant une solution sans validation”. Ces articles présentent des solutions qui ne sont pas (encore) implémentées ou validées ; aucune analyse des observations ou résultats obtenus suite à la mise en œuvre n’est évoquée. Finalement, 8 articles présentent des “recherches théoriques”. Ce qui correspond bien à la nature très appliquée du sujet (conformité au RGPD). Ces articles ont principalement pour objectif de définir les concepts clefs et théories concernant les contraintes du RGPD et l’impact au niveau des processus métiers. L’objectif de cette analyse est d’identifier les étapes du cycle de vie du PM comportant le plus grand nombre d’études et de recherches concernant la conformité au RGPD mais également en identifiant les étapes comportant des lacunes, un manque de recherche ou ne comportant pas de solutions bien définies. Les quatre étapes du cycle de vie d’un PM sont le Design, la Configuration, l’Exécution et l’Évaluation. Figure 4. Résultat de la classification par étape du cycle de vie selon BPM Le “Design” est l'étape la plus présentée par les articles scientifiques (23 articles). Les chercheurs proposent un grand nombre de modèles de PM conformes aux contraintes du RPGD. La notion de conformité s'articule autour de la notion de but / finalité. [12] propose d’associer les processus métiers avec un ou plusieurs objectifs permettant d’identifier les finalités et de classer les types de données collectées, en conformité avec le RGPD. [44] présente un modèle conceptuel du RGPD qui intervient comme un outil d’aide à la modélisation de processus métiers. C’est un outil pour aider à l'élaboration d'une politique de confidentialité organisationnelle. L’objectif est de l’utiliser comme un cadre de référence pour conduire la définition des règles de confidentialité car il fournit une vue d'ensemble pratique mais concrète du RGPD. En comprenant l'état existant des activités de traitement des données dans une organisation et en les instanciant dans le modèle, les zones de conformité partielle ou de non-conformité peuvent être identifiées à partir desquelles des politiques internes peuvent être construites et même renforcées et des actions peuvent être menées au niveau de l’élaboration des processus métiers. Une autre application potentielle de ce modèle peut être le développement d’extensions de langages de modélisation conformes au RGPD. [3] évoque les 7 principales contraintes du RGPD et un processus métier est défini pour chacun d’eux grâce aux langages BPMN. L’étape de “Configuration” est considérée par 15 articles. Cette étape permet de s’intéresser à la configuration que nous pouvons mettre en place pour mettre en œuvre le processus métier (ressources organisationnelles, composants SI). L'intégration directe des exigences du RGPD dans la configuration et par la suite à l'exécution des processus métier représente un aspect clé à la fois pour la gestion de la confidentialité et la validation pour les entreprises. [11] et [19] proposent une approche qui utilise le modèle juridique du RGPD pour enrichir un processus métier d'annotations qui expriment des exigences de protection des données. L’étape “d’Évaluation” est prise en compte par 11 articles. Ces articles évoquent principalement des techniques et méthodes d’analyse à partir des logs existants pour analyser les processus métiers et être conforme au RGPD. Une grande majorité des articles évoquent la nécessité de revoir la conception des processus métiers suite à l’analyse. [29][49][50] évoquent une solution de conformité RGPD orientée entreprise en se basant sur l’utilisation de fouille de processus (process mining). [29] prévoit d'utiliser et d'améliorer les techniques de fouille de processus pour résoudre les problèmes tels que le contrôle de conformité des processus métiers. L’étape “d'Exécution” est présentée dans 2 articles. Les auteurs de [16] proposent une intégration directe des exigences du RGPD dans l’exécution des processus métiers via l’utilisation de services de sécurité tels que les contrôles d’accès. Cela peut représenter un aspect clé à la fois pour la gestion et l'assurance de la confidentialité. Le faible nombre d'articles centrés sur cette étape du cycle de vie peut indiquer que le retour d'expérience et les solutions pour une analyse de conformité RGPD en “run time” sont toujours en cours de développement. Nous pouvons conclure que la communauté considère que l’élaboration d’un nouveau processus métier reste pour le moment une solution plus efficace pour répondre à la conformité du RGPD par rapport à l'évolution d’un processus déjà existant. Tableau 5. Analyse selon la phase du cycle de vie Phase Articles du SLR [3][7][8][10][11][12][13][15][17][22][23][24][26][27][28][31][32][33][36][44][46][47][48] Design Configuration [1][2][5][6][14][19][21][30][35][37][38][39][40][42][43] Exécution [16][41] Évaluation [4][9][18][20][25][29][34][45][49][50][51] 5. Discussion Suite à notre analyse, nous pouvons répondre à nos questions de recherche définies pour cette étude : Comment la communauté scientifique BPM envisage la conformité des processus métiers aux RGPD ? QR1 : La gestion des processus métiers offre-t-elle un ensemble suffisant de méthodes et outils pour assurer la conformité au RGPD dans les organisations ? Beaucoup de publications (Figure 1) illustrent un grand intérêt de la communauté scientifique BPM pour le sujet de protection de données. Les techniques et les méthodes de modélisation, d’analyse et d'évaluation de processus métiers sont considérées comme des outils des plus importants pour les entreprises afin d’assurer la conformité au RGPD. La plupart des contributions scientifiques étudiées proposent des solutions pratiques (avec ou sans validation) - ce qui illustre une grande valeur appliquée (Figure 3). QR2 : A quelles étapes du cycle de vie interviennent les impacts de la conformité au RGPD ? Toutes les étapes du cycle de vie d’un processus métier sont concernées par la conformité du RGPD et représentées par les articles de recherche (Figure 4). Il est important d’initier les processus métiers conformes au RGDP mais également de surveiller le fonctionnement et le flux des données dans la phase d’évaluation. Dans la classification par thème de l’analyse quantitative, les étapes les plus approfondies qui ont été remontées sont les étapes de design et de la configuration. QR3 : Comment les praticiens intègrent le RGPD dans les processus métiers existants ? D'après notre étude, peu de recherches rapportent des résultats sur des processus métiers déjà existants (étape d’exécution) et leur mise en conformité “at run time” (Figure 4). Certaines contributions sont axées sur le Contrôle et l’Exploration (Figure 2), où la conformité (ou l'absence de conformité) au RGPD peut être détectée en utilisant des techniques de fouille de processus. QR4 : Comment les normes RGPD sont intégrées à la conception du processus ? Le “Design” est l’étape la plus alimentée par la communauté scientifique (Figure 4). Elle comporte un nombre important de solutions pertinentes et d’aide à la modélisation des processus métiers conformes au RGPD. L'intérêt pour cette étape peut s’expliquer par l’effet qu’elle comporte un coût budgétaire plus faible. En effet, la prise en compte du RGPD dès le départ permet d’éviter plusieurs difficultés telles que le fait de retravailler sur plusieurs points du projet nécessitant la conformité qui peuvent impliquer des coûts supplémentaires mais également un retard dans la mise en production. De plus, lorsque la conformité est prise en compte dès le démarrage, le risque de poursuites judiciaires pour cause de manquement est réduit comparé à la mise en place de la conformité sur des processus existants. En examinant les différentes étapes de cycle de vie BPM, nous avons identifié les deux étapes les plus impactées par RGPD: l'étape de Design où la communauté scientifique cherche à assurer la conformité RGPD en amont, par des technique de modélisations et d’analyse de modèles; et l'étape d'Évolution, où la communauté cherche à valider la conformité RGPD en aval, par exemple par des techniques de fouille de processus. La communauté scientifique envisage le BPMN comme un langage adéquat pour viser la conformité du RGPD. Un grand nombre d’articles évoquent des solutions d’évolution du BPMN pour représenter les processus métiers. Suite à l’exécution des processus métiers, les méthodes d’explorations sont soulevées par certains articles pour surveiller et contrôler la conformité des processus métiers. L’objectif étant de s’assurer que les processus métiers liés au RGPD soient continuellement surveillés. Les écarts entre les processus modélisés et les traces générées par les journaux doivent être identifiés, optimisés et initier les changements des processus futurs conformes au RGPD. Les techniques de fouille de processus sont très efficaces pour évaluer les processus métiers et envisager une re-conception après avoir fait une analyse des violations existantes dans le processus métier. L’objectif étant d’effectuer un suivi des processus liés au RGPD. Les étapes de surveillance sont très importantes pour les entreprises, car depuis la mise en place du RGPD, les entreprises ont l’obligation de prouver qu’elles se conforment à celui-ci. Ainsi, les logs et les techniques de fouille de processus permettent d’établir les preuves nécessaires (données supprimées, accès, finalités, etc.). 6. Conclusion Traditionnellement, n'ayant pas d'obligation en place, les organisations et les entreprises traitent les données personnelles de personnes, dans quelques cas sans consentement explicite, avec des finalités d’utilisation non définies, les conservant pour des périodes illimitées et même les sous-louant à d'autres entreprises. Le règlement européen sur la protection des données impose depuis le 25 mai 2018 de nouvelles contraintes aux entreprises concernant le traitement des données à caractère personnel. Par conséquent, cela engendre de grands changements organisationnels comme le déploiement de personnes dédiées à la protection des données, la modification des politiques d’accès aux données, la formation du personnel pour améliorer la culture et la sensibilisation à la confidentialité, des modifications techniques comme la mise à jour des processus métiers. Le RGPD influence fortement la façon dont les organisations doivent aborder la confidentialité des données, les forçant à repenser et à mettre à niveau leurs processus métiers afin de s’y conformer. Pour de nombreuses organisations, cela peut être une tâche complexe, car jusqu'à présent, très peu de travaux ont été réalisés pour identifier facilement les problèmes de confidentialité dans les processus métiers. Notre étude avait pour but d’examiner cette problématique afin de faire ressortir les solutions envisagées, les avantages et les limites des recherches scientifiques sur la conformité des processus métiers au RGPD. Nous avons effectué un focus sur chaque étape du cycle de vie d’un processus métier afin d’y observer les recherches menées jusqu’à aujourd’hui. Nous constatons que la conformité est à prendre en compte dans toutes les étapes du cycle de vie d’un processus métier, notamment les étapes de modélisation et de configuration. Certaines recherches proposent des solutions alternatives dans les deux autres phases comme les contrôles d’accès ou la fouille de processus. Il est à noter que 40% des articles ne présentent pas de preuves empiriques et/ou solutions de mise en œuvre. En effet, l’entrée en vigueur du RGPD datant de 2018, les recherches concernant la conformité des processus métiers au RGPD n’en sont qu’à leurs débuts. Par conséquent, l’objectif d’un grand nombre de chercheurs est de mettre en œuvre ces solutions afin d’analyser les résultats obtenus et d’effectuer une validation de la solution. Une fois avoir validé la solution, il s’agira d’établir une approche pour la mise en œuvre de celle-ci dans les entreprises. De plus, un deuxième domaine peu évoqué mais pouvant être intéressant dans les travaux futurs concerne le transfert des données à des tiers. Le RGPD a des règles précises concernant les acteurs qui peuvent transférer des données à d'autres parties, quand ces transferts peuvent avoir lieu et dans quelles circonstances les autres parties peuvent ou doivent supprimer, produire ou stocker des données. Ainsi, il serait intéressant de proposer des solutions pour les entreprises sur cet aspect du RGPD qui est peu évoqué actuellement. Pour finir, ce présent travail est une étape préliminaire pour recenser les solutions visant la conformité des processus métiers au RGPD. Afin de poursuivre ce travail, il serait pertinent de s’intéresser également (a) au RGPD en amont des processus en se focalisant sur l’impact du règlement sur l’ingénierie des exigences et (b) à l’aspect infrastructure impactée par le RGPD, ainsi qu’aux problématiques de circulation et de stockage des données concernées. Nous souhaitons également étudier la mise en œuvre des solutions proposées par la communauté scientifique sur des cas pratiques réels pour les entreprises.",
  "2024-RDJ": "1. Introduction De nos jours, la technologie informatique permet de stocker et de traiter pratiquement toutes les informations susceptibles d'intéresser une organisation. Cependant les utilisateurs ne contrôlent pas souvent la manière dont leurs données personnelles sont collectées, stockées et traitées. Le règlement général sur la protection des données (RGPD), entré en vigueur en mai 2018, constitue une étape importante dans la direction de la protection des données personnelles [EU 16] . Le but du RGPD est de protéger les citoyens de l'UE contre les atteintes à la vie privée de leurs données personnelles. Le RGPD contrôle la manière dont les organisations traitent les informations personnelles de leurs clients et accorde aux individus des droits de protection renforcés en ce qui concerne ces données. Les organisations non conformes au RGPD doivent faire face à de lourdes sanctions. Le RGPD présente un impact majeur sur la plupart des processus métiers des entreprises dès sa mise en œuvre. Les entreprises sont tenues de mettre en œuvre correctement les politiques de gestion des données du RGPD et de prendre les mesures appropriées sur les données lorsque leurs clients le demandent. La conception et le développement des nouveaux systèmes d’information ainsi que l’évolution des systèmes déjà existants vers la conformité aux normes RGPD est un enjeu important pour les entreprises d’aujourd’hui. En ingénierie des SI, des solutions peuvent être apportées par un ensemble de domaines différents. Dans ce travail, nous allons nous concentrer sur un seul domaine - celui de la Gestion des Processus Métier (BPM). Les entreprises adoptent de plus en plus les systèmes de gestion de processus métiers (BPMS) afin de gérer leurs activités et la gestion des données. Ainsi, pour © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 1 – – atteindre la conformité au RGPD, les organisations doivent remodeler leur approche de la gestion des données personnelles stockées et échangées lors de l'exécution de leurs processus métiers. Bien que la modélisation des processus métier soit bien adaptée pour exprimer la collaboration des parties prenantes et les données échangées entre les activités des processus métier et les participants, il y a peu d’études concernant la conformité du RGPD et l’identification des violations potentielles de la vie privée dans le cycle de vie d’un processus métier. Dans cette revue systématique de la littérature (SLR) nous analysons les solutions/approches évoquées par la communauté scientifique pour la mise en conformité des processus métiers au RGPD. Les objectifs sont de (i) examiner les recherches actuelles concernant l'intégration du RGPD dans les pratiques de gestion de processus métier et notamment dans les différentes phases de cycle de vie d’un processus métier et (ii) identifier les lacunes de la recherche actuelle afin de suggérer des domaines à approfondir. L’article est organisé de la manière suivante. La section 2 donne une définition des éléments clés de cette revue. La section 3 présente le protocole de recherche utilisé. La section 4 présente les résultats de l’analyse. Nous discuterons les résultats obtenus dans la section 5 et conclurons dans la section 6. 2. Définition des Termes Clés Le règlement général sur la protection des données est la nouvelle loi de l'Union européenne pour la protection des données personnelles. Le RGPD définit les données à caractère personnel comme toute information relative à une personne physique identifiée ou identifiable (“personne concernée”). Cela signifie qu'une personne concernée est une personne physique (un être humain vivant) dont les données sont gérées par un responsable du traitement [EU 16]. Depuis 2018, le nouveau règlement a pour objectif de renforcer les droits des individus sur leurs propres données ainsi que de rendre les organisations plus responsables. Il contribue à l'harmonisation des précédentes lois fragmentées sur la protection des données à travers l'UE, afin d'assurer une protection égale des droits de l'Homme des citoyens européens. Le RGPD définit les principes suivants concernant les données et leurs traitements : – la transparence (les données doivent être traitées de manière équitable, licite et transparente) ; – la pertinence (les données ne devraient être collectées qu'à des fins déterminées, explicites et légitimes, et non traitées ultérieurement à d'autres fins) ; – la minimisation (les données traitées doivent être pertinentes, adéquates et limitées à ce qui est nécessaire au regard des finalités pour lesquelles elles sont traitées) ; – la précision (les données traitées doivent être exactes et régulièrement mises à jour) ; – la conservation (les données doivent être supprimées après une période limitée) ; – le consentement explicite (les données ne peuvent être collectées et traitées que si la personne donne son consentement explicite). Les processus métiers se réfèrent généralement à toute collection structurée d'activités ou de tâches connexes effectuée pour atteindre les objectifs visés d'une organisation. Il peut être structuré en un ou plusieurs ensembles définis d'activités qui représentent les étapes nécessaires pour atteindre des objectifs relatifs aux affaires, y compris les flux et utilisations d'informations et de ressources. La gestion des processus métier (BPM) comprend des concepts, des méthodes et des techniques pour prendre en charge la conception, l'administration, la configuration, la mise en œuvre et l'analyse des processus métier 10]. [WES Le cycle de vie d’un processus métier, selon BPM, est composé de 4 étapes principales : conception et analyse, configuration, exécution et évaluation. © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 2 – – – la Conception : au cours de cette étape, les processus métier sont identifiés, examinés, validés et représentés par des modèles graphiques. Cette représentation facilite la communication entre les différentes parties prenantes sur les processus, permettant de les affiner et de les améliorer [WES 10]. – La Configuration : Les modèles de processus métier sont mis en œuvre au travers d’un ensemble de politiques et de procédures auxquelles les employés de l'entreprise doivent se conformer par le biais d’un système d’information dédié (i.e., un système de gestion de processus ou BPMS). Le modèle de processus métier est donc enrichi d'informations techniques permettant de développer (si nécessaire) des composants logiciels manquants et de configurer l’environnement organisationnel et technique déjà existant de l’entreprise. Cette configuration comprend la définition et le développement (ou le paramétrage) des interfaces entre les processus métiers et ces utilisateurs ainsi que l'intégration des systèmes logiciels existants avec le système de gestion des processus. Une fois le système configuré, la mise en place des processus métiers sera testée puis mise en œuvre [WES 10]. – L’Exécution (ou la Mise en œuvre) : au cours de cette étape, les instances de processus métier sont déclenchées et exécutées pour atteindre les objectifs métier définis. Le système de gestion des processus contrôle activement l'exécution : la mise en œuvre du processus doit garantir la conformité aux contraintes d'exécution spécifiées dans le modèle de processus. Pendant l'exécution, les informations opérationnelles sur les instances de processus (e.g., l’état actuel, le temps d'exécution, les anomalies, les traces d'exécution) sont enregistrées dans les journaux (log) pour une analyse plus approfondis [WES 10]. – L’Analyse : au cours de cette étape, les informations des journaux d'exécution sont utilisées pour évaluer et améliorer les processus métier et sa performance. Les données pertinentes (par exemple, les marqueurs de début/fin des tâches, les identifiants des acteurs impliqués dans les tâches, les exceptions, etc) sont recueillies et analysées pour déterminer le degré de performance du processus par rapport à ses mesures de performance. Les techniques de fouille de processus peuvent être utilisées afin de valider l'adéquation d’un processus exécuté par rapport à son modèle et à son environnement d'exécution [WES 10]. Figure 1. Cycle de vie d’un processus métier BPMN (www.omg.org) est le formalisme de représentation des processus métiers qui est la norme de facto pour la modélisation des processus. Il s'agit d'un langage riche et expressif utilisé pour les tâches associées à la modélisation des processus. 3. Protocole de Recherche Nous avons effectué une revue systématique de littérature 06]. La réforme du RGPD [BRE 07] [LEV est un sujet récent, ici nous examinons comment ce sujet est intégré par la communauté de recherche BPM au travers des outils, méthodes, théories et leurs applications dans la pratique. Nous nous sommes basées sur la méthodologie proposée par 07]. Cette méthodologie définit les trois phases [KIC principales de notre projet : (i) planification de la recherche et définition des questions de recherche; © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 3 – – (ii) étude de sources bibliographiques ; (iii) extraction et analyse des données. Dans la première phase, nous définissons les principales questions de recherche. Dans la deuxième phase, nous effectuons une recherche systématique de la littérature selon le protocole illustré par Figure 2. Dans la dernière phase, nous analysons les articles de recherche collectés et répondons aux questions de recherche définies dans la première phase. Les phases (i) et (ii) sont présentées dans la suite de cette section. Les résultats de la phase (iii) - Extraction et Analyse - sont présentés dans la section 4. 3.1. Planification et définition de questions de recherche Cette étude vise à examiner les récentes méthodes et solutions pour la conformité des processus métiers au RGPD. Il faut savoir qu’il n’existe aujourd’hui aucune pratique standardisée du RGPD. Il est exigé que les entreprises fournissent un niveau de protection de données personnelles raisonnable mais il n’y a pas d’exigence détaillée sur la manière dont les organisations doivent mettre en œuvre le RGPD au sein de leurs processus métiers. Ainsi, les organisations doivent elles-mêmes évaluer leurs processus métiers et mettre en œuvre un plan d’action pour s’y conformer. La question de recherch centrale (QR) est la suivante. QR : Comment la communauté scientifique BPM aborde-t-elle la conformité des processus métier avec le RGPD ? Nous avons développé notre étude afin de répondre aux sous-questions plus spécifiques : QR1 : La conformité au RGPD est-elle considérée comme un sujet pertinent pour la communauté BPM ? Si c'est le cas, quels types de contributions sont produites par la communauté et quels sont les défis restants à résoudre ? QR2 : A quelles étapes du cycle de vie d’un processus métier interviennent les impacts de la conformité au RGPD ? De plus, nous avons examiné séparément les impacts du RGPD sur la conception de nouveaux processus (avec pour objectif d'intégrer les normes RGPD “by design”) et sur l'évolution des processus existants (avec pour objectif d'établir la conformité aux normes plus tard dans leurs cycles de vie), ceci nous a permis de définir deux autres sous-questions : QR3 : Comment les praticiens intègrent le RGPD dans les processus métiers existants ? QR4 : Comment les normes RGPD sont intégrées à la conception du processus ? 3.2. Étude de Sources bibliographiques Nous avons choisi de suivre la méthode de recherche proposée par qui consiste à définir les [AHA 11] termes et les chaînes de recherches pour la recherche automatique via les différents moteurs de recherche. Par la suite, nous avons complété par une recherche manuelle. En complétant et en évaluant dans les deux sens la recherche manuelle et la recherche automatique, il a été possible de définir un ensemble de publications pertinentes sur lesquelles nous avons effectué la technique nommée « effet boule de neige » qui repose sur les différentes références que les auteurs ont utilisées dans les publications qui constituent notre revue de littérature. Le processus est illustré par la Figure 1. 3.2.1. Recherche automatique Les mots clefs utilisés pour la recherche reprennent les termes de “RGPD” et “Business process”. Par conséquent, les articles qui concernent les domaines tels que « business process management », « business process modeling », « business process design », etc. seront identifiés. Nous avons utilisé la © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 4 – – base de connaissance Scopus (scopus.com) pour identifier la liste initiale des articles. Nous avons ciblé les articles qui répondent aux deux critères suivants : 1) Les mots « General Data Protection Regulation » ou l’acronyme RGPD doivent se trouver dans le titre, l’abstract ou les mots clés. 2) Les mots « business process » doivent se trouver dans le titre, l’abstract, ou les mots clés. La chaîne de recherche obtenue est : TITLE-ABS-KEY(\"Business process\") AND (TITLE-ABS- KEY(\"General Data Protection Regulation\") OR TITLE-ABS-KEY(GDPR)). Nous avons ensuite établi une liste de critères à respecter pour chacun des articles à conserver pour notre étude, en appliquant des critères d’inclusion et d’exclusion. Figure 2. Processus d’Étude de Sources bibliographiques Critères d’inclusion : CI1 : la source est un article ou un chapitre de livre CI2 : la source évoque le problème de conformité au RGPD et son impact sur les processus métiers Critères d’exclusion : CE1 : la source est un livre ou des actes de conférences CE2 : la source s’intéresse à la conformité du RGPD sans évoquer l’impact sur la gestion des processus métiers © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 5 – – 3.2.2. Recherche manuelle Une fois la sélection terminée, tous les articles identifiés sont utilisés pour former le quasi-gold standard (QGS). Le QGS est établi en effectuant une recherche manuelle dans les articles sélectionnés, afin d'identifier les articles jugés les plus pertinents, selon les experts. A partir de celui-ci, nous allons effectuer la méthode de l’effet boule de neige pour étendre notre bibliographie: on examine (i) les articles qui se trouvent dans les références de notre QGS (« recherche en amont ») et (ii) les articles qui, de leur coté, citent les article de notre QGS (« recherche en aval »). Suite au protocole de recherche défini (Figure 2), nous avons établi une liste de 78 articles afin d’effectuer notre analyse. Pour la simplicité de présentation, nous avons regroupé ces articles dans la première partie de notre bibliographie et ajouté un index numérique. 4. Extraction et Analyse des Données Nous examinons ici l’ensemble des 78 articles sélectionnés afin de caractériser la recherche de manière quantitative et qualitative. Nous avons extrait et exploité les données sur la date de publication, le thème principal, le type de recherche et le rapport avec une étape spécifique du cycle de vie du processus selon BPM. 25 23 20 19 15 10 10 8 8 5 3 2 1 1 1 1 1 0 2007 2008 2009 2014 2015 2016 2017 2018 2019 2020 2021 2022 Figure 3. Distribution des articles examinés par année de publication La Figure 3 illustre la distribution des articles selon leur année de publication. Cette distribution démontre que l'intérêt par rapport aux problématiques de traitement de données personnelles dans le BPM a été traité avant l'application officielle du RGPD, le 25 mai 2018, par les pays membres de l’Union Européenne. Les articles publiés [ROD 07][WOL 08][MEN 09] [MAT 13] [AHM 14] [ALT 15] [SAN 15] [SAL 17] [ANT 16] entre 2007 et 2016 peuvent être considérés comme les précurseurs de la problématique traitée par notre étude. Ils traitent les exigences de sécurité pour les processus métier ([ROD 07][WOL 08][MEN 09] [MAT 17]) et étudient l’importance d’une modélisation adéquate. Les extensions du langage 13] [ALT 15] [SAL BPMN centrées sur la sécurité sont proposées dans [ROD 07][WOL 08][MAT 13] [AHM 14] [ALT 15] [SAN 16]. 15] [SAL 17] [ANT © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 6 – – Nous avons constaté un intérêt croissant pour la technologie liée au RGPD dans les articles publiés depuis 2020 : dans les publications parues entre 2007 et 2019 (50 articles au total) seulement 3 articles évoquaient les aspects technologiques et/ou un impact de la conformité au RGPD sur les technologies d’entreprises 19c]); cependant, à partir de 2020 (38 articles), 7 articles ont ([BEN 18], [FAH 19], [ZEM évoqué ce sujet 22]). Nous nous ([BAR 20a], [BAR 20b], [POS 21], [DEC 20], [BAR 21], [FRE 21], [POL intéresserons au thème de la Technologie dans la section suivante. Le nombre croissant de publications ces dernières années prouve que la conformité au RGPD est un 1 problème traité par la communauté BPM . 4.1. Classification des articles selon le type de contribution Nous avons établi 3 types d’articles selon leur type de contribution : Recherche proposant une théorie : Ce type d’article a pour objectif d’établir une problématique ou question de recherche afin d’y répondre en déterminant les concepts clefs, les théories et les idées préexistantes en lien avec le sujet choisi sans proposer de solutions pratiques. Recherche proposant une solution sans validation empirique : Ce type d’article consiste en une proposition de solutions à un problème ou question de recherche défini sans validation empirique c’est- à-dire aucune preuve d’observation ou d’expérimentation pour la solution proposée. Recherche proposant une solution avec validation empirique : par ce type, nous avons regroupé les articles proposant une solution à un problème ou question de recherche défini avec une validation/preuve empirique (des exemples de cas pratiques, des expérimentations sont évoqués dans les articles). La Figure 4 illustre la distribution des travaux de recherches par type de contribution. Figure 4. Résultat de la classification par type de contribution Parmi les travaux examinés, un grand nombre d'articles proposent des solutions pour la conformité des processus métiers au RGPD avec des preuves empiriques (33 articles). Ces preuves sont 1 Nous supposons que, au moment de cette publication (janvier 2022), les articles publiés en 2021 ne sont pas encore tous indexés par les moteurs de recherche ; Cela explique aussi qu’il n’y ait qu’un seul article de 2022 qui apparaisse dans notre liste. © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 7 – – principalement des démonstrations suite à des observations/expérimentations ou des validations par les pairs. Ces articles sont également accompagnés de cas pratiques pour démontrer les solutions proposées. Ainsi, ils proposent non seulement un aspect théorique avec une approche ou méthodologie bien définie mais également un aspect pratique en démontrant la mise en œuvre de leurs solutions et analysant les observations et résultats obtenus. 23 articles présentent des “recherches proposant une solution sans validation”. Ces articles présentent des solutions qui ne sont pas (encore) implémentées ou validées ; aucune analyse des observations ou résultats obtenus suite à la mise en œuvre n’est évoquée. Finalement, 22 articles présentent des solutions uniquement théoriques. Ces articles ont principalement pour objectif de définir les concepts clefs et théories concernant les contraintes du RGPD et l’impact au niveau des processus métiers. Nous avons détaillé la distribution des contributions selon le type dans la Figure 6. Thèmes Articles [GON 17] [PAN 18] [KAS 18] [TOM 18] [PAL 18b] [BES 19] [MEH 19] [VOG 20] [ROB Recherche théorique 20] [PRI 19] [DIA 20] [POS 21] [BES 20b] [ROO 20] [LIO 20] [VAN 20] [ROU 21] [WIN 21] [FRE 21] [BES 20a] [ZEM 19c] [DEV 19] [MAT 13] [BUC 17] [BAR 17] [AGA 17] [ROB 17] [BEN 18] [HUE 18] [PIL 18] [PAL 18a] Recherche proposant une solution [FAH 19] [AGO 19] [BAR 19b] [BAS 18] [ZAM 19b] [ARB 19] [TOO 19] [GER 19] sans validation empirique [COR 19] [CAP 20] [BON 20] [DEC 20] [AMA 21] [POL 22] [ROD 07] [WOL 08] [MEN 09] [AHM 14] [ALT 15] [SAN 15] [SAL 17] [ANT 16] Recherche proposant une solution avec validation empirique [HEU 17] [NOT 17] [PUL 17] [AGA 18] [AHM 18] [KAS 20] [CAP 19] [BAR 19a] [CAL 19] [ARF 19] [PUL 19] [BAR 20c] [BAR 20a] [BAR 20b] [DIM 20] [MAT 20] [ZAM 19a] [WIN 20] [TAC 20] [RAM 20] [ZAM 20a] [ZAM 20b] [BAR 21] [DUM 21] [COR 21] Tableau 1. Analyse selon le type de contribution 4.2. Classifications des articles selon des thèmes Nous avons classé des articles sélectionnés sur 7 thèmes principaux (certains articles peuvent s’intéresser à plusieurs thèmes): Modélisation, Langage, Évaluation, Exigences, Contrôle, Exploration, Technologie. La Figure 5 illustre la distribution des articles entre les différents thèmes. © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 8 – – Figure 5. Résultat de la classification par thème 4.2.1. Modélisation Ce thème regroupe les articles qui proposent des outils, des méthodes ou des patrons de modélisation, ainsi que des modèles conceptuels pour la conformité d’un processus métier au RGPD. Ce thème est traité dans 38 articles sur les 78 articles examinés. Parmi ces 38 articles de nombreux travaux adhèrent au concept de conformité par la conception (\"compliance by design\") : ils proposent d'assurer la conformité au niveau du modèle et d'appliquer les règles de confidentialité et/ou de sécurité directement au modèle de processus, exprimé en BPMN ou autre langage de modélisation. Certains articles proposent des modèles de conception de processus métier propres à chaque contrainte du RGPD. D'autres articles de ce thème portent sur la modélisation explicite du RGPD : ils proposent des techniques d'extraction et de formalisation des règles de confidentialité du texte du RGPD afin de faciliter le contrôle automatisé de la conformité. D’autres articles proposent des modèles UML ou modèles de conception d’aide à la modélisation - des modèles représentant les différentes contraintes du RGPD pour une meilleure compréhension des relations des diverses contraintes. En examinant les types de contribution dans ce thème (Figure 6-a), nous avons identifié 39% de contributions présentant des solutions pratiques avec une validation empirique, 32% présentant des solutions (ou idées de solutions) sans validation et 29% pour des contributions théoriques (voir la section 4.1 pour la discussion sur les types de contributions). C’est une distribution équilibrée qui montre un thème bien traité par la communauté de la recherche. 4.2.2. Évaluation Les 22 articles regroupés dans ce thème s’intéressent aux méthodes et outils permettant d’évaluer des processus métier et leur environnement d’exécution afin d’assurer la conformité au RGPD. Ce thème est abordé dans la littérature depuis 2018, année d'entrée en vigueur du RGPD. Les articles examinés évoquent les méthodes d'évaluation de la conformité au RGPD sur plusieurs niveaux d’architecture d’entreprise : métier, systèmes, et infrastructure. Au niveau métier, la conformité des processus métiers organisationnels est évaluée indépendamment des plateformes d'exécution ; au © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 9 – – niveau systèmes, la conformité des systèmes d'information qui réalisent des processus métier est examinée ; au niveau de l'infrastructure, l'impact du RGPD sur différentes technologies d'infrastructure (par exemple, Blockchain, Cloud, IoT) est évalué. Concernant les types de contributions (Figure 6-b), notre analyse démontre que 55% (la plupart) des contributions présentent une solution avec une validation empirique ; 27% des contributions sont des articles théoriques et 18% des articles présentent une solution (ou une idée de solution) sans validation. Cette distribution peut être expliquée par un intérêt pratique dans les outils d’évaluation. 4.2.3. Langage Ce thème regroupe des articles qui proposent un nouveau langage de modélisation ou une évolution d’un langage de modélisation (ex. : BPMN) pour traiter explicitement la conformité du RGPD. Ce thème est évoqué dans 20 articles. Beaucoup de travaux sur les langages de modélisation traitant explicitement des aspects de sécurité et de confidentialité ont été publiés avant l'entrée en vigueur du RGPD en 2018 (9 articles). Sur les 20 articles examinés, une majorité d'articles évoque la conformité des processus métiers au RGPD via l’évolution du BPMN. BPMN est le formalisme le plus couramment utilisé pour représenter les processus métiers. Il est conçu pour être un langage extensible et peut être utilisé pour créer des extensions pour de nouveaux artefacts dans les diagrammes BPMN. Des extensions du langage BPMN axées sur la sécurité et confidentialité (« security-aware BPMN » ou « privacy-enhanced BPMN ») ont été proposées dans 20]). ([ROD 07],[AHM 14],[ALT 15],[SAN 15],[SAL 17],[PUL 17], [PUL 19], [RAM Un grand nombre d'articles propose des solutions d’extensions de BPMN pour représenter les tâches liées à la protection des données. La deuxième solution la plus évoquée dans ce thème vise à intégrer le modèle juridique du RGPD dans un processus métier. Par exemple, le modèle DAPRECO [LIO 20] [PAL propose un formalisme et définit un référentiel de règles RGPD écrites en LegalRuleML - 18b][ROB 20] un standard pour représenter le contenu sémantique et logique des documents juridiques. La majorité des articles de ce thème présentent une solution avec une validation (Figure 6-c). 4.2.4. Exigences Ce thème regroupe les articles qui s’intéressent aux exigences par rapport aux processus métiers et à leurs environnements d’exécution (i.e., SI d’entreprises) en lien avec le RGPD, ainsi que des techniques et des outils permettant l’extraction et la formalisation de ces exigences. Ce thème est évoqué dans 18 articles. Ils traitent principalement des exigences de sécurité et de confidentialité. La majorité des articles est centrée sur la conception de processus métier - 12 articles ([ROD 07],[WOL 08], 20a]) ; 7 articles [MEN 09],[MAT 13],[BUC 17],[BAR 13],[VOG 20],[COR 19],[DIA 20][ZAM 20b],[RAM 20],[BES 20a]) évoquent les exigences par rapport aux ([ALT 15],[SAL 17],[ZEM 19c],[PIL 18],[POL 22], [RAM 20],[BES systèmes d’information et à l’infrastructure lors de la phase de configuration et d’exécution de processus et 1 article 19]) traite des exigences par rapport aux techniques d’analyse de processus ([FAH (i.e., process mining). La figure 6-d illustre la distribution des contributions dans ce thème par type. 4.2.5. Contrôle Les articles regroupés ici proposent des méthodes et des outils de monitoring et de contrôle de conformité par rapport au RGPD pour des processus métier déjà mis en place. Ici, le contrôle de conformité, le diagnostic d’anomalies et les risques en temps réel sont les sujets les plus évoqués. Ce thème est traité dans 6 articles. Les contrôles proposés pour les processus métiers existants concernent les contrôles d’accès et d’habilitation afin d’effectuer des contrôles sur chaque activité exécutée ([CAL 19],[BAS 18],[ROO 20], [DEV 19],[DEC 20],[BEN 18],[KAS 20]). © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 10 – – 4.2.6. Exploration Ce thème regroupe les articles traitant des techniques d'analyse des processus métiers axés sur la conformité au RGPD. Ces techniques explorent divers artefacts de processus (les spécifications, les modèles, les traces d'exécution, etc.) et peuvent être utilisées pour évaluer la conformité au RGPD, pour découvrir une violation de conformité et pour contribuer à la (re)conception et évolution des processus métier existants ainsi que des nouveaux processus. Les méthodes de fouille de processus au service du RGPD et des processus métiers sont particulièrement courantes. D’autres méthodes sont basées sur le monitoring de processus et sur l’utilisation de technologies de protection de la vie privée (PETs). Les technologies de protection de la vie privée sont des technologies qui incarnent les principes fondamentaux de protection des données en minimisant l'utilisation des données personnelles, en maximisant la sécurité des données et en responsabilisant les individus. Des exemples de ces technologies incluent le contrôle d'accès, la confidentialité différentielle, le VPN, etc. Nous avons trouvé 8 articles qui s’intéressent à l’exploration ([BEN 18],[ZAM 19a],[MEH 19],[ZAM 19b],[ARF 21]). 19],[TAC 20],[ZAM 20a],[DUM 4.2.7. Technologie Ce thème regroupe les articles qui examinent le rôle d'une technologie particulière pour assurer la conformité au RGPD pour les entreprises ou, inversement, qui explorent l'impact du RGPD sur l'utilisabilité, la faisabilité, l'efficacité de ces solutions dans les organisations. Ce thème est traité dans 10 articles de notre sélection. Nous avons constaté un intérêt croissant pour les technologies Blockchain considérées aujourd’hui comme une plateforme d’exécution pour les processus inter-organisationnels. Ce sujet est traité dans 10 articles 21]). Le problème ([BEN 18],[MEH 19],[ZAM 19b],[ARF 19],[ZAM 19a],[TAC 20],[ZAM 20a],[DUM soulevé par les chercheurs concerne les blockchains dont les ledgers distribués sont « uniquement en ajout » : une fois que les données sont ajoutées, elles ne peuvent plus être retirées d’une Blockchain. De plus, chaque modification des données historiques peut être immédiatement invalidée. Les mécanismes pour faire face aux exigences de suppression et de rectification du RGPD sont en conséquence de grand intérêt aujourd’hui. Thèmes Articles [WOL 08] [MAT 13] [AHM 14] [SAL 17] [ANT 16] [HEU 17] [NOT 17] [BUC 17] [BAR 17] [GON 17] [AGA 17] [PAN 18] [HUE 18] Modélisation [TOM 18] [PAL 18b] [PAL 18a] [BES 20a] [DEV 19] [BES 19] [AGO 19] [BAR 19b] [BAR 19a] [ARB 19] [VOG 20] [COR 19] [BAR 20c] [BAR 20a] [BAR 20b] [MAT 20] [CAP 20] [WIN 20] [BES 20b] [RAM 20] [BAR 21] [DUM 21] [ROU 21] [WIN 21] [AMA 21] [ROD 07] [AHM 14] [ALT 15] [SAN 15] [SAL 17] [NOT 17] [AGA 17] [PUL 17] [ROB 17] [AGA 18] [DEV 19] [KAS 20] [BAR 19a] Langage [ROB 20] [PUL 19] [GER 19] [WIN 20] [BON 20] [RAM 20] [AMA 21] [KAS 18] [PIL 18] [AGA 18] [AHM 18] [DEV 19] [BES 19] [KAS 20] [CAP 19] [TOO 19] [PRI 19] [COR 19] [BAR 20c] [BAR 20b] Évaluation [DIM 20] [MAT 20] [ZAM 19a] [BON 20] [LIO 20] [VAN 20] [BAR 21] [DUM 21] [COR 21] [ROD 07] [WOL 08] [MEN 09] [MAT 13] [ALT 15] [SAL 17] [BUC 17] [BAR 17] [PIL 18] [BES 20a] [FAH 19] [VOG 20] [ZEM Exigences 19c] [COR 19] [DIA 20] [RAM 20] [ZAM 20b] [POL 22] [BEN 18] [BES 20a] [KAS 20] [CAL 19] [BAS 18] [DIM 20] [ROO 20] [DEC 20] [COR 21] Contrôle [BEN 18] [MEH 19] [ZAM 19b] [ARF 19] [ZAM 19a] [TAC 20] [ZAM 20a] [DUM 21] Exploration [BEN 18] [FAH 19] [ZEM 19c] [BAR 20a] [BAR 20b] [POS 21] [DEC 20] [BAR 21] [PRE 21] [POL 22] Technologie Tableau 2. Analyse selon le thème © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 11 – – b) a) d) c) Figure 6. Type de contributions par thème 4.3. Classification selon l’étape du cycle de vie d’un Processus Métier (d'après BPM) L’objectif de cette analyse est d’identifier les étapes du cycle de vie des processus métier les plus concernés par la conformité au RGPD d’après les travaux de recherche recueillis. Nous cherchons à examiner les types de contributions pour chaque étape afin d’identifier les lacunes et de suggérer de nouvelles directions de recherche. Les quatre étapes du cycle de vie d’un processus métier sont la Conception, la Configuration, l’Exécution et l’Analyse. Certains articles traitent la conformité au RGPD sur plusieurs étapes. La Figure 7 illustre la distribution des articles entre les étapes. 4.3.1. Conception La Conception est l'étape la plus présentée par les articles scientifiques (42 articles). Les chercheurs proposent un grand nombre de modèles de processus métier conformes aux contraintes du RPGD. La majorité de ces travaux se concentre sur les approches et les techniques de modélisation pour répondre aux exigences de sécurité et de confidentialité « de la conception » des processus (i.e., le principe de « compliance by design »). Ces exigences sont explicitement traitées dans 13 articles ([ROD 07][WOL 20b]). 08][MEN 09][MAT 13][BUC 17][BAR 17][PIL 18][BES 20a][VOG 20][COR 19][DIA 20][RAM 20][ZAM Considéré comme langage de référence pour la modélisation de processus métier, BPMN est évoqué dans 21]. Par exemple, [ROD 07] [AGO 19][AHM 14][KAS 20][BAR 19a][PUL 19][WIN 20][RAM 20][AMA évoque les 7 principales contraintes du RGPD et un processus métier est défini pour chacun [AGO 19] d’eux grâce au langage BPMN. © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 12 – – Figure 7. Résultat de la classification par étape du cycle de vie selon BPM La modélisation explicite des règles du RGPD est considérée comme une autre approche conduisant à un processus métier conforme au RGPD dès la conception. [TOM 18] présente un modèle conceptuel du RGPD qui intervient comme un outil d’aide à la modélisation de processus métiers. C’est un outil pour aider à l'élaboration d'une politique de confidentialité organisationnelle. L’objectif est de l’utiliser comme un cadre de référence pour conduire la définition des règles de confidentialité car il fournit une vue d'ensemble pratique mais concrète du RGPD. En comprenant l'état existant des activités de traitement des données dans une organisation et en les instanciant dans le modèle, les zones de conformité partielle ou de non-conformité peuvent être identifiées, puis des politiques internes peuvent être construites et même renforcées et des actions peuvent être menées au niveau de l’élaboration des processus métiers. Une autre application potentielle de ce modèle peut être le développement d’extensions de langages de modélisation conformes au RGPD. Concernant les types de contributions (Figure 8-a), notre analyse démontre que 43% des contributions présentent une solution avec une validation empirique ; 28% des contributions sont des articles théoriques et 29% des articles présentent une solution (ou une idée de solution) sans validation. 4.3.2. Configuration L’étape de Configuration est étudiée dans 28 articles. Cette étape permet de s’intéresser à la configuration que nous pouvons mettre en place pour mettre en œuvre le processus métier (ressources organisationnelles, composants SI). L'intégration directe des exigences du RGPD dans la configuration et par la suite à l'exécution des processus métier représente un aspect clé à la fois pour la gestion et la validation de la confidentialité pour les entreprises. Parmi les 28 travaux examinés, 8 articles ont été publiés avant l'entrée en vigueur du RGPD ([AHM 17]). Ces articles proposent des solutions 14][ALT 15][SAN 15][SAL 17][NOT 17][AGA 17][PUL 17][ROB pour la mise en place des processus métier qui s’intéressent explicitement aux aspects de sécurité et de confidentialité des données d’entreprise. Parmi les articles publiés à partir de 2018, un grand nombre est centré sur la configuration d’un processus métier sur une infrastructure particulière ([BEN 18][ZEM 22]). IoT, Cloud, Blockchain sont les 19c][BAR 20a][BAR 20b] [BAR 20c] [DEC 20][BAR 21][FRE 21][POL technologies évoquées. Par exemple, et proposent une approche qui utilise le [BAR 20a] [BAR 19a] modèle juridique du RGPD pour enrichir un processus métier d'annotations qui expriment des exigences de protection des données. La Figure 8-b illustre la distribution des articles traitant la configuration par type de contribution. © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 13 – – 4.3.3. Exécution L’étape d'Exécution est présente dans 15 articles. Alors que certains articles proposent d'étendre les processus existants avec des activités de contrôle et/ou des scénarios d'exécution spécifiques par rapport au RGPD, d'autres proposent de surveiller et de contrôler la conformité au RGPD pendant l’exécution du processus, sans changer le processus lui-même. Les auteurs de proposent une [CAL 19] intégration directe des exigences du RGPD dans l’exécution des processus métiers via l’utilisation de services de sécurité tels que les contrôles d’accès. Cela peut représenter un aspect clé à la fois pour la gestion et l'assurance de la confidentialité. Le faible nombre d'articles centrés sur cette étape du cycle de vie peut indiquer que les retours d'expérience et les solutions pour une analyse de conformité RGPD en “run time” sont toujours en cours de développement. Dans [BAS 18], la notion de conformité s'articule autour de la notion de but / finalité. Les auteurs proposent d’associer les processus métiers avec un ou plusieurs objectifs permettant d’identifier les finalités et de classer les types de données collectées, en conformité avec le RGPD. Comme pour l’étape de configuration, de nombreux travaux concernent l’environnement d’exécution 21]). La technologie Blockchain est ([DEC 20], [BEN 18], [POL 22], [POS 21], [BAR 20b], [BAR évoquée dans [POS 21]. Par exemple, les auteurs de proposent une 21][BAR 20b][BAR [POS 21] infrastructure Blockchain compatible avec le RGPD. La Figure 8-c illustre la distribution des articles traitant l’exécution par type de contribution. 4.3.4. Analyse L’étape d’Analyse est prise en compte par 14 articles. Ces articles évoquent principalement des techniques et méthodes d’analyse à partir des logs existants pour analyser les processus métiers et être conforme au RGPD. Une grande majorité des articles évoquent la nécessité de revoir la conception des processus métiers suite à l’analyse. évoquent une solution de [ZAM 19a] [ZAM 19b] [MEH 19] [FAH 19] conformité RGPD orientée entreprise en se basant sur l’utilisation de fouille de processus (process mining). prévoit d'utiliser et d'améliorer les techniques de fouille de processus pour résoudre [MEH 19] les problèmes tels que le contrôle de conformité des processus métiers. Nous pouvons conclure que la communauté considère que l’élaboration d’un nouveau processus métier reste pour le moment une solution plus efficace pour répondre à la conformité du RGPD par rapport à l'évolution d’un processus déjà existant. La Figure 8-d illustre la distribution des des articles traitant l’analyse par type de contribution . © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 14 – – Thèmes Articles [ROD 07][WOL 08][MEN 09] [MAT 13][AHM 14][ANT 16][HEU 17][BUC 17][BAR 17][GON 17] Conception [PAN 18][KAS 18][HUE 18][PIL 18][TOM 18][PAL 18b][PAL 18a][BES 20a][BES 19] [KAS 20] [AGO 19][BAR 19b][BAR 19a][ARB 19][VOG 20][PUL 19][COR 19][BAR 20c][BAR 20a] [DIA 20] [BAR 20b][DIM 20][MAT 20][CAP 20] [WIN 20] [BES 20b][RAM 20][ZAM 20b][BAR 21][ROU 21] [WIN 21][AMA 21] [PIL 18][ALT 15][SAN 15][SAL 17][NOT 17][AGA 17][PUL 17][ROB 17][BEN 18][AHM 14][AGA 18][AHM Configuration 18][BAR 19a][PUL 19][BAR 20c][BAR 20a][BAR 20b][ROB 20][GER 19][ZEM 19c] [RAM 20][BAR 21][BON 20][DEC 20][VAN 20][FRE 21][COR 21][POL 22] [BEN 18] [DEC 20] [POL 22] [DEV 19] [KAS 20] [CAL 19] [BAS 18] [DIM 20] [BAR 20b] [POS 21] [BAR 21] [BES Exécution 19] [ROO 20] [COR 21] [BES 20a] [BAS 18] [FAH 19] [CAP 19] [MEH 19] [COR 21] [ZAM 19b] [TOO 19] [ARF 19] [PRI 19] [ZAM 19a] [TAC 20] Analyse [LIO 20] [ZAM 20a] [DUM 21] Tableau 4. Analyse selon la phase du cycle de vie b) a) c) d) Figure 8. Type de contributions par étape du cycle de vie © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 15 – – 5. Discussion Suite à notre analyse, nous pouvons répondre à nos questions de recherche définies pour cette étude : QR : Comment la communauté scientifique BPM aborde-t-elle la conformité des processus métier avec le RGPD ? QR1 : La conformité au RGPD est-elle considérée comme un sujet pertinent pour la communauté BPM ? Si c'est le cas, quels types de contributions sont produites par la communauté et quels sont les défis restants à résoudre ? Le nombre de publications (Figure 3) illustrent un grand intérêt de la communauté scientifique BPM pour le sujet de la protection de données. Les techniques et les méthodes de modélisation, d’analyse et d'évaluation de processus métiers sont considérées comme des outils des plus importants pour les entreprises afin d’assurer la conformité au RGPD. La plupart des contributions scientifiques étudiées proposent des solutions pratiques (avec ou sans validation) - ce qui illustre une grande valeur appliquée (Figure 4). QR2 : A quelles étapes du cycle de vie d’un processus métier interviennent les impacts de la conformité au RGPD ? Toutes les étapes du cycle de vie d’un processus métier sont concernées par la conformité du RGPD et représentées par les articles de recherche (Figure 7). Il est important d’initier les processus métiers conformes au RGDP mais également de surveiller le fonctionnement et le flux des données dans la phase d’évaluation. Nous avons identifié les 7 thèmes les plus fréquemment abordés par les chercheurs (section 4.2) : les outils et techniques de modélisation des processus, les langages de modélisation, et les méthodes et outils d'évaluation des processus sont parmi les sujets les plus évoqués. Ces sujets sont souvent associés à l’étape de conception du cycle de vie du processus. Les solutions proposées visent la « conformité dès la conception ». Néanmoins, la conformité RGPD est également activement recherchée lors des phases ultérieures du cycle de vie (configuration, exécution, analyse). QR3 : Comment les praticiens intègrent le RGPD dans les processus métiers existants ? Nous avons pu identifier 15 publications avec des résultats sur des processus métiers déjà existants (étape d’exécution) et leur mise en conformité en cours d’exécution (« at run time ») (Figure 7). Certaines contributions sont axées sur le Contrôle et l’Exploration (Figure 5), où la conformité (ou l'absence de conformité) au RGPD peut être détectée en utilisant des techniques de fouille de processus. QR4 : Comment les normes RGPD sont intégrées à la conception du processus ? La Conception est l’étape la plus alimentée par la communauté scientifique (Figure 7). Elle comporte un nombre important de solutions pertinentes et d’aide à la modélisation des processus métiers conformes au RGPD. L'intérêt pour cette étape peut s’expliquer par l’effet qu’elle comporte un coût budgétaire plus faible. En effet, la prise en compte du RGPD dès le départ permet d’éviter plusieurs difficultés telles que le fait de retravailler sur plusieurs points du projet nécessitant la conformité qui peuvent impliquer des coûts supplémentaires mais également un retard dans la mise en production. De plus, lorsque la conformité est prise en compte dès le démarrage, le risque de poursuites judiciaires pour cause de manquement est réduit comparé à la mise en place de la conformité sur des processus existants. En examinant les différentes étapes de cycle de vie BPM, nous avons identifié les deux étapes les plus impactées par le RGPD : l'étape de Conception où la communauté scientifique cherche à assurer la © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 16 – – conformité RGPD en amont, par des techniques de modélisation et d’analyse de modèles ; et l'étape de Configuration, où la communauté cherche à évaluer et développer les environnements d’exécution de processus conformes au RGPD. Nous avons constaté un intérêt croissant pour la technologie liée au RGPD depuis 2020. Notamment, la Blockchain est considérée aujourd’hui comme une plateforme d’exécution pour les processus inter-organisationnels. La compatibilité de cette plateforme avec les contraintes RGPD est souvent abordée par les chercheurs. La communauté scientifique envisage le BPMN comme un langage adéquat pour viser la conformité du RGPD. Un grand nombre d’articles évoquent des solutions d’évolution du BPMN pour représenter les processus métiers. Suite à l’exécution des processus métiers, les méthodes d’exploration sont soulevées par certains articles pour surveiller et contrôler la conformité des processus métiers. L’objectif étant de s’assurer que les processus métiers liés au RGPD soient continuellement surveillés. Les écarts entre les processus modélisés et les traces générées par les journaux doivent être identifiés, optimisés et initier les changements des processus futurs conformes au RGPD. Les techniques de fouille de processus sont reconnues efficaces pour évaluer les processus métiers et envisager une re-conception après avoir fait une analyse des violations existantes dans le processus métier. L’objectif étant d’effectuer un suivi des processus liés au RGPD. Les étapes de surveillance sont très importantes pour les entreprises car, depuis la mise en place du RGPD, les entreprises ont l’obligation de prouver qu’elles se conforment à celui-ci. Ainsi, les logs et les techniques de fouille de processus permettent d’établir les preuves nécessaires (données supprimées, accès, finalités, etc.). Validité de l’étude Dans ce travail, nous appliquons un protocole de recherche empirique, basé sur l’étude systématique de la littérature. spécifie 2 axes principaux pour examiner la validité de la recherche : validité [WOH 03] interne et validité externe. Nous allons d’abord présenter nos arguments pour justifier la qualité de cette recherche selon ces derniers axes. Ensuite nous proposons les 5 catégories de validité selon [THO 11]. La validité interne est la mesure dans laquelle une étude établit une relation de cause à effet digne de confiance entre un traitement et un résultat 03]. La validité interne repose sur la rigueur d’un [WOH protocole de recherche. Notre étude a été menée de manière systématique, afin de couvrir les travaux de recherche publiés entre janvier 2007 et janvier 2022. Afin d’assurer la validité interne, notre protocole est documenté dans la section 3. Il permet de valider la pertinence d’ensemble des travaux examinés, des questions de recherches posées et des réponses obtenues afin de confirmer la validité interne de ce travail. Cependant, la phase de recherche manuelle basée sur l’analyse de texte et la recherche « boule de neige » restent les choix subjectifs de 3 chercheurs (auteurs de cette article). Ceci représente un obstacle à la validité d’actuelle étude, souvent adressé comme « biais de l'expérimentateur ». La validité externe est la mesure dans laquelle les résultats de l'étude peuvent être généralisés/applicables à un groupe plus large de personnes, d'organisations, de projets ou de situations. Notre étude est basée sur l’analyse de 78 articles - échantillon d’une grande taille, permettant de faire des observations statistiquement importantes. Nos conclusions peuvent être considérées valides pour des processus métiers de manière générale. Néanmoins, les articles examinés représentent des projets de recherches / des domaines d’applications / cas d’utilisations / types d’entreprises différents et donc ne nous permettent pas de tirer une conclusion sur la généralisabilité de nos résultats pour un domaine industriel (ex. : finance) ou un type entreprise (ex. : PME) en particulier. Ceci représente un obstacle à la validité. Pour pallier cet obstacle, une autre recherche, se concentrant sur des pratiques ou domaines industriels particuliers est nécessaire. propose 5 catégories de validité que nous détaillons dans le tableau suivant. [THO 11] © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 17 – – Validité Nous avons unifié les critères utilisés dans l’étude et structuré l’information à Validité descriptive : se réfère à recueillir à l’aide d’un formulaire d’extraction de données pour un l’exactitude des données enregistrement uniforme des données. Néanmoins, un obstacle à la validité lié au fait que les données ont été recueillies, filtrées et interprétées par 3 experts humains (« biais de l'expérimentateur ») peut être cité. Afin de pallier cet obstacle, un ensemble plus grand d’experts (chercheurs et praticiens) pourrait être envisagé pour cette étude. - Nous avons utilisé une chaîne de recherche et l’avons appliquée à une base de Validité théorique : dépend de la données comprenant les bibliothèques numériques les plus populaires en capacité d’obtenir l’information informatique et en génie logiciel. qu’elle est censée saisir. - Un ensemble de critères d’inclusion et d’exclusion a été défini. - Nous avons combiné deux méthodes de recherche différentes : une recherche automatique et une recherche manuelle (en sens inverse et en sens inverse), afin de réduire le risque de ne pas trouver toutes les preuves disponibles. - Le choix des sources anglaises devrait avoir un impact minimal en ce qui concerne l’élimination des autres langues. Notre ensemble de questions de recherche est suffisamment général pour Validité de généralisation : identifier et classer les résultats sur la prise en compte du RGPD dans les concerne la capacité de généraliser processus métiers. Cette étude ne permet pas de généraliser les conclusions sur les résultats. un domaine industriel ou un type d’entreprise en particulier. Trois chercheurs ont étudié les résultats et validé chaque conclusion. Aucun Validité évaluative : obtenue expert de l'industrie (domaine BPM) ou de la pratique juridique (RGPD) n'a été lorsque les conclusions sont impliqué dans cette étude. Cela peut être considéré comme une menace à la raisonnables compte tenu des validité. données. Le protocole du processus de recherche est suffisamment détaillé pour qu’il Validité de transparence : fait puisse être répété de façon exhaustive. référence à la répétabilité du protocole de recherche. 6. Conclusion Traditionnellement, n'ayant pas d'obligation en place, les organisations et les entreprises traitent les données personnelles de personnes, dans quelques cas sans consentement explicite, avec des finalités d’utilisation non définies, les conservant pour des périodes illimitées et même les sous-louant à d'autres entreprises. Le règlement européen sur la protection des données impose depuis le 25 mai 2018 de nouvelles contraintes aux entreprises concernant le traitement des données à caractère personnel. Par conséquent, cela engendre de grands changements organisationnels comme le déploiement de personnes dédiées à la protection des données, la modification des politiques d’accès aux données, la formation du personnel pour améliorer la culture et la sensibilisation à la confidentialité, des modifications techniques comme la mise à jour des processus métiers. Le RGPD influence fortement la façon dont les organisations doivent aborder la confidentialité des données, les forçant à repenser et à mettre à niveau leurs processus métiers afin de s’y conformer. Pour de nombreuses organisations, cela peut être une tâche complexe car, jusqu'à présent, très peu de © 2024 ISTE OpenScience Published by ISTE Ltd. London, UK openscience.fr Page | 18 – – travaux ont été réalisés pour identifier facilement les problèmes de confidentialité dans les processus métiers. Notre étude avait pour but d’examiner cette problématique afin de faire ressortir les solutions envisagées, les avantages et les limites des recherches scientifiques sur la conformité des processus métiers au RGPD. Nous avons effectué un focus sur chaque étape du cycle de vie d’un processus métier afin d’y observer les recherches menées jusqu’à aujourd’hui. Nous constatons que la conformité est à prendre en compte dans toutes les étapes du cycle de vie d’un processus métier, notamment les étapes de modélisation et de configuration. Certaines recherches proposent des solutions alternatives dans les deux autres phases comme les contrôles d’accès ou la fouille de processus. Il est à noter que 40% des articles ne présentent pas de preuves empiriques et/ou solutions de mise en œuvre. En effet, l’entrée en vigueur du RGPD datant de 2018, les recherches concernant la conformité des processus métiers au RGPD n’en sont qu’à leurs débuts. Par conséquent, l’objectif d’un grand nombre de chercheurs est de mettre en œuvre ces solutions afin d’analyser les résultats obtenus et d’effectuer une validation de la solution. Une fois la solution validée, il s’agira d’établir une approche pour sa mise en œuvre dans les entreprises. De plus, un deuxième domaine peu évoqué mais pouvant être intéressant dans les travaux futurs concerne le transfert des données à des tiers. Le RGPD a des règles précises concernant les acteurs qui peuvent transférer des données à d'autres parties, quand ces transferts peuvent avoir lieu et dans quelles circonstances les autres parties peuvent ou doivent supprimer, produire ou stocker des données. Ainsi, il serait intéressant de proposer des solutions pour les entreprises sur cet aspect du RGPD qui est peu évoqué actuellement. Le travail présenté ici est une étape préliminaire pour recenser les solutions visant la conformité des processus métiers au RGPD. Afin de poursuivre ce travail, il serait pertinent de s’intéresser également (a) au RGPD en amont des processus en se focalisant sur l’impact du règlement sur l’ingénierie des exigences et (b) à l’aspect infrastructure impactée par le RGPD, ainsi qu’aux problématiques de circulation et de stockage des données concernées. Nous souhaitons également étudier la mise en œuvre des solutions proposées par la communauté scientifique sur des cas pratiques réels pour les entreprises."
}