{
  "2025-LR": "AI assistants grounded on Large Language Models (LLM) and Generative Pretrained Transformers (GPT), with ChatGPT as a popular example, are a new generation of technology, simulating human- like behavior, social interaction, and provoking emotional feedback from users. In this study, we examine the determinants affecting users’ trust in GPT services. Using structural equation modeling, we analyze data collected from 124 respondents. Compared to previous studies grounded on theories of technology acceptance, we focus on social aspects of trust formation. Our conceptual framework integrates key Trust determinants from the Integrative Model of Organizational Trust and examines the role of knowledge in technology in general and AI awareness in particular in trust formation.",
  "2025-AR": "Although Blockchain Technology (BCT) is widely acknowledged for its disruptive potential in reshaping in- dustries through decentralization and enhanced security, its adoption has been slower than anticipated. To address this gap, this secondary study examines 21 recently published surveys on BCT acceptance. While existing literature confirms the critical role of trust in BCT acceptance, our study examines its effect in detail, focusing on the role it plays in the theoretical acceptance models — whether as a predictor, mediator, or mod- erator. This research contributes to a deeper understanding of the BCT adoption process, which is essential for effective policy-making and defining and implementing digital transformation strategies within organizations.",
  "2024-RKHPNS": "We propose a holistic design approach that extends a tradi- tional Model Driven Architecture paradigm with the bottom-up constraint analysis and propagation. We define a Unified Feature Model that rep- resents the organizational goals and the technical properties of the solution, and use model-checking to reason about the constraints that arise from their interplay. In the illustrative example, we show how the tech- nical decisions specified in a Feature Model can be formalized, validated, and translated into strategic limits of a Goal Model for further redesign of both business and technical enterprise models.",
  "2024-HRH": "In this work, we explore the application of Enterprise Archi- tecture (EA) frameworks, specifically TOGAF and ArchiMate, to model the alignment between socio-political artifacts and technological artifacts within Decentralised Autonomous Organisations (DAOs). DAOs are new organisation model that leverages blockchain (BC) technology to implement decentralised governance such as Liquid Democracy (LD) which respect anarchist principles. However, the challenge lies in demonstrating the traceability between socio-political governance processes and the technological artifacts that enables these processes. This paper addresses this gap by applying Design Science Research (DSR) methodology to develop a reference architecture. This Architecture serves as a struc- tured model to analyze and verify the alignment of decentralised gov- ernance processes with their technological implementations DAOs. This work contribution is a systematic approach to modelisation and analysis of socio-political structures of decentralised organisations, ensuring they align with the underlying technology supporting them.",
  "2024-RR": "Cyber-Physical Systems (CPS) refer to integrated computational and physical processes, where computational elements monitor and control physical processes, usually with a feedback loop.Analysis of trust formation within a complex networks of linked social, physical and computational entities has a potential to reveal otherwise implicit trustworthiness requirements and to improve the CPS design and acceptance. We address this challenge with a method for trust analysis that supports the alignment between trust concerns expressed by the prospective CPS users and stakeholders, trustworthiness requirements formulated by the CPS designers and technical elements of the CPS to be developed. We apply this method to a real CPS design project. Our case study shows that the explicit analysis of trust not only improves traceability between user trust concerns and technical features of the CPS, but also allows for identification of new relevant trustworthiness requirements, affecting the system design and acceptance.",
  "2024-BRLG": "Corpora analysis is a common task in digital humanities that profits from the advances in topic modeling and visualization from the computer science and information system fields. Topic modeling is often done using methods from the Latent Dirichlet Allocation (LDA) family, and visualizations usually propose views based on the input documents and topics found. In this paper, we first explore the use of Formal Concept Analysis (FCA) as a replacement for LDA in order to visualize the most important keywords and then the relevance of multiple documents concerning close topics. FCA offers another method for analyzing texts that is not based on probabilities but on the analysis of a lattice and its formal concepts. The main processing pipeline is as follows: first, documents are cleaned using TreeTagger and BabelFy; next, a lattice is built. Following this, the mutual impact is calculated as part of the FCA process. Finally, a force-based graph is generated. The output map is composed of a graph displaying keywords as rings of importance, and documents positioned based on their relevance. Three experiments are presented to evaluate the keywords displayed and how well relevance is evolving on the output map.",
  "2024-KHRS": "TheModel-DrivenArchitecture(MDA)servesasanessential framework for designing enterprise information systems, emphasizing the alignment and traceability of goals across different modeling layers. How- ever, MDA typically overlooks the integration of qualitative attributes, or softgoals, which are critical for enhancing user satisfaction. Our previous work introduced the Technology-Aware Enterprise Modeling (TEAEM) approach, which enhances MDA by integrating model checking, validation, and impact analysis. This paper extends TEAEM to more effectively incorporate softgoals. We achieve this by integrating SysML component modeling for low-level, and softgoals into the high-level of the MDA. These advancements fa- cilitate bottom-up constraint propagation and ensure that technological decisions are reflected consistently at all levels of abstraction, thereby optimizing the system to meet strategic business goals. Additionally, we propose generating configurations in software product lines, driven by the fulfillment of softgoals, to apply the TEAEM approach.",
  "2023-RG": "In modern society, where digital security is a major preoccupation, the\nperception of trust is undergoing fundamental transformations. Blockchain\ncommunity created a substantial body of knowledge on design and development\nof trustworthy information systems and digital trust. Yet, little research is focused\non broader scope and other forms of trust. In this study, we review the research\nliterature reporting on design and development of blockchain solutions and focus\non trustworthiness requirements that drive these solutions. Our findings show that\ndigital trust is not the only form of trust that the organizations seek to reenforce:\ntrust in technology and social trust remain powerful drivers in decision making.\nWe analyze 56 primary studies, extract and formulate a set of 21 trustworthiness\nrequirements. While originated from blockchain literature, the formulated\nrequirements are technology-neutral: they aim at supporting business and\ntechnology experts in translating their trust issues into specific design decisions\nand in rationalizing their technological choices. To bridge the gap between social\nand technological domains, we associate the trustworthiness requirements with\nthree trustworthiness factors defined in the social science: ability, benevolence\nand integrity.",
  "2023-RZS": "Digital technologies enable novel models of social and business interactions, where trust becomes a critical design consideration. A thorough analysis of trust issues and their implications at different enterprise levels, including strategies, processes and technological solutions, becomes an imperative part of socio-technical systems design. In this study we examine trust issues that emerge among the actors of a Digital Business Ecosystems (DBE) which, if not properly addressed, can jeopardize DBE functioning and resilience. An explicit mapping between the generic DBE roles and the social factors of trustworthiness is the main contribution of this work. We demonstrate how this mapping is used in the analysis of trust issues in the context of a Higher Education Alliance DBE. This analysis leads to the identification of explicit trustworthiness requirements that can guide (re)design of DBE strategies, processes and technical platforms.",
  "2023-KRHS": "Blockchain technology is a decentralized and distributed ledger that allows for secure, transparent, and immutable tracking of transactions. However, it is not a one-size-fits-all solution for addressing trust issues in the supply chain. In software engineering, design patterns provide a blueprint that developers can follow to solve a specific problem in a structured and efficient manner. In this paper, we identify and discuss the reusable blockchain software patterns that can be applied to design trustworthy solutions in supply chain management (SCM). Based on the literature analysis, we define a comprehensive taxonomy of SCM-specific trust issues. Then we apply requirement engineering technique to translate these issues into trust requirements and demonstrate how these requirements can be met by the specific blockchain software patterns.",
  "2020-KRNRW": "Manycompeting,complementary,generic,orspecificmethod- ologies for design and analysis co-exist in the field of Information System Engineering. The idea of reconciling these methodologies and their underlying theories has crossed the minds of researchers many times. In this paper, we inquire into the nature of such reconciliation using the interpretivist research paradigm. This paradigm acknowledges the exis- tence of diverse points of view as ways of seeing and experiencing the world through different contexts. We examine why it might be impossible to reconcile these methodologies that each represents a point of view. Instead of searching for the one (overarching, universal, global, ultimate) methodology that reconciles all others, we explain why we should think about reconciliation as an ongoing practice. We propose to the community a set of heuristics for this practice. The heuristics are a result of our experience in reconciling a number of methods that we created as part of our research during the past 20 years. We illustrate the use of the heuristics with an example of use cases and user stories. We believe these heuristics to be of interest to the Information Systems Engineering community.",
  "2019-RRW": "We use homeostasis, the maintenance of steady states in an organism,\nto explain some of the decisions made by participants in a business process. We\nuse Vickers’ Appreciative System to model the homeostatic states with Harel’s\nstatecharts. We take the example of a doctoral student recruitment process\nformally defined between a faculty member, a graduate student candidate and a\ndoctoral school. We analyze some gaps in the process caused by a misfit\nbetween norms of the process participants. We present a rationale for the\nanticipation and resolution of these misfits. We extend the traditional\noperational model with an appreciative model. This model represents the\nappreciative systems of process participants. Understanding these appreciative\nsystems is necessary to make explicit the misfit between the model and the\nobserved reality. The operational model represents the “technical” perspective\non the business process, the one that can be automated. The appreciative model\nrepresents the “social” perspective, the one that explains the participants’\nbehavior as a result of their individual and collective norms. By combining\nthese two perspectives, we can appreciate the richness of the development of\nsocio-technical systems.",
  "2019-BRLG": "Processes where knowledge is a key characteristic are called knowledge intensive processes (KIP). A successful KIP has to adapt for the situation and to treat each customer’s request as unique rather than to follow some predefined sequence of actions. The discipline of Business Process Management (BPM) defines solutions for modeling, development, analysis and improvement of processes with a predefined flow of activities. From the traditional, activity-centered point of view, KIP are challenging to automate, to control and to test for compliance.\nIn this article we present the overview of recent works that address the challenges and explore different ideas, including extension of BPM, theoretical foundations for KIP management and execution support for KIP. We also outline some research perspectives in KIP management and discuss one particular idea that exploits the data-centered point of view on KIP.",
  "2018-RR": "We use homeostasis, the maintenance of steady states in an organism, to explain some of the decisions made by participants in a business process. We use Vickers’s Appreciative System to model the homeostatic states with Harel’s statecharts. We take the example of a PhD recruitment process formally defined between a faculty member, a graduate student candidate and a doctoral school. Our analysis uncovers some hidden process scenarios. As a result, these scenarios can be integrated into the process model and eventually taken into account by the process supporting software.",
  "2017-ZR": "Getting more value from IT is becoming a critical objective for today’s organizations. IT Governance is an important strategic instrument that should ensure organizations to succeed with this objective and therefore it needs to be efficiently planned, structured and executed. To respond to increasing service demands while preserving or even increasing the value provided by services, public organizations require resources and abilities that lay outside their boundaries - such as co-production, open innovation, as well as engagement of citizens and partner organizations. To respond to these challenges, public organizations need to employ new governance solutions to their IT to overcome the shortcomings of hierarchical structures and traditional centralized decision-making. In this study, we discuss a capability-oriented governance approach, which aligns envisioned public values with actors, processes and resources and accordingly compound different IT Governance capabilities. We illustrate our proposal on the student mobility case in the Higher Education public service.",
  "2017-RZ": "Modern public organizations undergo an important transformation becoming a\npart of dynamic “innovative ecosystem” where they co-create value with citizens,\ngovernment, policy makers and other institutions. Information Technology plays a\ncentral role in this transformation. Getting more value from IT becomes an\nintrinsic part of organizational mission. Information Technology Governance\n(ITG) is an important instrument that ensures that the organization will succeed in\nits mission. Efficient yet adaptive ITG is indispensable. To respond to the\nincreasing service demand, public organizations require resources and capacities\nthat lay outside the organization. Co-production, engagement of citizens and\npartner organizations, open innovation – are some of the major challenges.\nMeeting these challenges, public organizations need to master new governance\nstyles to overcome the shortcomings of hierarchical structures and centralized\ndecision making. In this work, we define a model where we adopt the theory of\npublic value in order to reason about different contexts where ITG mechanisms\nare proposed as capabilities. We distinguish between three ITG styles: centralized,\nfederated and decentralized and thereby provide a rationale allowing public\norganizations to identify an ITG style that fits best to their value-creation context\nand corresponding capability patterns as reusable ways for implementing\ngovernance of IT.",
  "2017-RLGS": "Explicit process specifications play an important role in process-aware information systems (PAIS). Whereas methodologies for modeling structured, activity-oriented processes are well established, modeling formalisms for unstruc- tured processes such as case management processes (CMP) are lagging. In this chapter, we define a state-oriented formalism that allows for executable specifi- cations of CMP and paves the road for predictive analysis and recommendations support intended to case managers. This formalism is grounded on statecharts devel- oped by D. Harel in 1987. We adopt the main concepts defined by statecharts and demonstrate how they can be used to specify a case management process. We also propose adaptations and potential extensions of the statecharts formalism that could address CMP specifics and complexity.",
  "2016-KRLG": "Knowledge and experience of a case manager re- mains a key success factor for Case Management Processes (CMPs). When a number of influential parameters is high, a number of possible scenarios grows significantly. Automated guidance in scenario evaluation and activity planning would be of a great help. In our previous work, we defined the statecharts semantics for visualisation and simulation of CMP scenarios. In this work, we formalise the state-oriented models with higraphs: higraphs provide mathematical foundation for statecharts and eventually enable a wide panoply of algorithms for process analysis and optimisation. We show how a statecharts diagram can be transformed into higraph and analysed at run-time with graph algorithms. In particular, we take an example of the Shortest Path algorithm and show how this algorithm can be used in order to guide the case manager suggesting her the best process scenario. Compared to BPM approaches, a state-oriented process scenario does not specify concrete activities but only the objectives and constraints to be met. Thus, our approach does not prescribe but describe an activity to be executed next. The manager can define an activity that fit the description ”on the fly”, based on her experience and intuition.",
  "2016-Dall": "This article describes some recent advances in the Information Systems research domain to support users of mobiles devices such as tablets or smartphones. Indeed, we show how information about the evolving context of users can be organized and analyzed through context management. We also describe an original approach called intention mining, which analyzes traces of users’ actions on the system and extracts the rational behind these actions (i.e., the user goals/intentions). Finally, we explain how adequate process modeling formalisms allow for personalized recommendations (and therefore adaptive scenarios) in order to optimize users experience with the information system.\nSo far, these approaches have mostly been applied to business process models, and we discuss their interest for video games, in particular urban games which combine physical and real worlds.",
  "2016-BRZ": "New business models imply decentralization of organizations and subsequent change of their management and operation styles. Originally designed for classical (bureaucratic) organizations, many Enter- prise Modeling (EM) methods do not explicitly address decentralization and thus require ”case-based” adaptations when applied to modern organizations. In this work, we analyze various organizational taxonomies presented in the literature focusing on criteria of organization decentralization. Using two case examples, we demonstrate how the application of the For Enterprise Modeling (4EM) method, efficient for a centralized organization, becomes more challenging for a decentralized organization. We discuss how this method can be extended in order to provide an explicit support for organizational decentralization.",
  "2015-KRLG": "Crisis management process has to comply with various norms and regulations; at the same time, it needs to constantly deal with uncertainty and adapt the process scenario to a current situation. These requirements make process design challenging: whereas conventional activity- oriented modeling formalisms ensure process control by design, they provide only limited support for run-time adaptability of a process scenario. State-oriented formalisms can overcome this deficiency and, thus, extend the process designers toolkit. In this paper, we consider the example of\na flood management process implemented as a part of the COS Operation Center - a smart city solution developed by COS&HT company in Russia. We examine the existing (BPMN) specification of this process and propose an alternative way to specify the process based on stat- echarts formalism. We model, animate and test the process scenarios with Yakindu Statecharts tools.",
  "2015-KRDLG": "Abstract. Process manager plays the central role in crisis management. In order to capture the intentions of the process manager, the process should be specified at a strategic level. In order to analyze how these intentions are fulfilled during the process execution, the process should be specified at an operational level. Whereas the variety of techniques for goal modeling and process modeling is presented in the market, pos- sibility to design a process seamlessly, from intentions (process goals) to executable scenarios, remains a challenging task. In this paper, we in- troduce an approach for modeling and simulating a crisis management process from goals to scenarios. We consider an example of flood management process specified for floods on Oka River in the Moscow region in Russia. In order to specify the intentions behind the flood management process, we use MAP formalism. For representing the process at the operational level, we use Statecharts formalism. To align the strate- gic and operation process levels, we translate the MAP model of flood management process to statecharts. We simulate the flood management process, showing how the process goals defined on the strategic level can be achieved by various scenarios executed in the operational level.",
  "2015-KRLGa": "Process-aware information systems (PAIS) supporting knowledge-intensive processes are gaining importance nowadays. Crisis management process is an example of a knowledge-intensive process that is grounded on vast experience of multiple actors (e.g., city services, volunteers, administration) and their collaboration. Automated crisis management systems have to comply with various norms and regulations; at the same time, they need to constantly deal with uncertainty and adapt the process scenario to a current situation.\nIn this paper, we consider the example of a flood management process implemented as a part of the COS Operation Center (COSOC) - a smart city solution that works with knowledge- intensive processes. We examine how the activity-oriented modeling paradigm underlying COSOC supports process flexibility. We propose an alternative way to specify the flood management process based on state-oriented paradigm and the statecharts formalism and discuss the advantages and limitations of the two paradigms.",
  "2014-ZRS": "Decentralization of organizations and subsequent change of their management and operation styles requires changes in organization’s processes and heavily involves the IT. A case study in the Higher Education sector in Sweden has shown that Enterprise Architecture (EA) frameworks fit to primarily centralized organizational structures, and as such have shortcomings when used in decentralized organizations. Overcoming these deficiencies requires some new principles to be introduced and incorporated into the EA knowledge. In particular for IT governance, the case study showed that the\npeer-to-peer principles, such as peer production, can offer more suitable governance over current EA frameworks as they are able to better match the decentralized components of the university’s organizational structure.",
  "2014-ZRSa": "Decentralization of organizations and subsequent change of their management and operation styles require changes in organization’s processes and heavily involve IT. Enterprise Architecture (EA) frameworks fit to primarily centralized organizational structures, and as such have shortcomings when used in decentralized organizations. We illustrate this idea on the example of one organization in the Higher Education sector that faces decentralization of its structure and has to adapt to it. Overcoming these challenges requires some new principles to be introduced and incorporated into the EA knowledge. In particular for IT governance, in this study we argue that peer-to-peer principles can offer more suitable governance over current EA frameworks as they are able to better align with decentralized components of an organizational structure.",
  "2014-RKPLG": "Humans dream about an intelligent computer assistant who would support them in critical situations thanks to its capacity to reason objectively, to take into account millions of factors and criteria and to value carefully thousands of alternatives prior to make a decision. HAL 9000, in Kubrick’s 2001: A Space Odyssey (IMDB 1968), is probably the most famous incarnation of such assistant. Being a fictional character, it reflects a number of great ideas of scientists from the 20th century who believed that machines one day would be capable of doing any work a man can do. Though it was shown that such a vision of computer technology is too optimistic, scientists keep working on theories and prototypes that can support practitioners in agile decision-making and smart process management. In this paper, we propose our vision of what academic research can do for such a pragmatic and experience-driven discipline as Adaptive Case Management and to discuss to what extent fiction may become reality in what we call automated guidance for case management?",
  "2013-RKPLG": "Future developments for enterprise process management must evolve from the current systems based on rigid, workflow based processes into context-aware, agile dynamic structures, which exploit local adaptability. In this idea paper, we define two forms of process agility. To enable these forms of agility, we present our vision of context-aware business process management based on declarative modeling combined with innovative context management and formal concept analysis. We finally describe the foundations and introduce the architecture of a context-aware agile business process engine (CAPE).",
  "2013-TMRW": "Large enterprises need to coordinate the IT initiatives that exist in different organisational units of the enterprise. If these initia- tives are not coordinated, the resulting IT system is likely to become difficult to use and expensive to develop/maintain. Enterprise architec- ture methods are designed for that purpose. We report on the use of a service-oriented enterprise architecture method, called SEAM, in the context of a mid-size university. The originality of SEAM is its service orientation and the recursive modeling from business down to systems. Using SEAM, we develop a service model of the overall organisation. The model is stored in a web-based tool. We also propose a concrete im- plementation of architectural principles described in the literature. This principles help build an integrated IT system. The paper explains the background of this project and the current progresses. This approach illustrates how enterprises can build a common view for their IT resources.",
  "2013-BBRWa": "Business rules are in the center of attention, both in the business world and in the IT world. Very often in a real systems, there is hundreds and thousands of rules to be captured. Some of these rules are implicit and thus poorly enforced, others are written but not enforced, and still others are perhaps poorly written and obscurely enforced.\nIn this work, we propose an interactive, simulation-driven approach for business rules discovery. The rules are specified in natural language and then translated to the Alloy declarative language. They are then sim- ulated using the Alloy Analyzer tool and the new or implicit rules are detected. Finally, the model is adjusted to synchronize the existing rules with the new rules. This way, the domain specialist together with the designer can interactively discover new business rules and check their consistency and validity.",
  "2013-SRZN": "The decentralization of organizations and subse- quent change to their management and operation style requires major changes in organization processes and heavily involves the IT. This paper demonstrates, however, that EA is primarily aimed at centralized organizational structures and as such has shortcomings when applied to decentralized organizations. Overcoming these deficiencies requires new principles to be introduced and incorporated into EA knowledge. A potential source for these principles are peer-to-peer architectures, which tackles the problem of decentralization in its own way. This paper presents prevalent decentralization principles from peer- to-peer, and how they have the potential to be applied to EA",
  "2013-RZS": "Enterprises with transparent boundaries, decentralized organizational structure, and constantly increasing requirements on IT flexibility, is a novel generation of organizations of 2020s. This paper elaborates on how the Enterprise Architecture (EA) can better support such organizations. We analyze three types of organizational structure: centralized, federated and decentralized. First, we identify the concepts that link organizational structure, IT Governance and EA. Then we use these concepts to identify conceptual problems related to IT decentralization, and to propose solutions. We illustrate our findings with a real case of a High Education organization in Sweden.",
  "2013-BBRWb": "Abstract. We explore invariants as a linking mechanism between the business and technical service perspectives: From the business perspec- tive, invariants can be used to model (business) requirements of an en- terprise; from the technical perspective, invariants express the properties that must hold during the execution of a service.\nWe propose an approach to enterprise service design that can be de- scribed as an iterative introduction and a modification of invariants in response to the evolution of business and/or technical service specifications. We formalize the service specifications in Alloy and demonstrate how each design iteration can be simulated, visualized and validated with the Alloy analyzer tool. We illustrate our findings with the example of Order Creation service.",
  "2013-KPR": "Case Management processes are characterized by their high unpredictability and, thus, cannot be handled following traditional process- or activity-centered approaches. Adaptive Case Management paradigm proposes an alternative data-centered approach for management such processes. In this paper, we elaborate on this approach and explore the role of context data in Case Management. We use the state-oriented representation of the process that allows us to incorporate the contextual information in a systematic and transparent way, leading towards agile case management.",
  "2013-R": "Efficient case management in industry is hampered by attempts to deal with case management process the same way as with regular business process. Development of the specific approaches for case management process modeling and analysis is therefore an important endeavor that can improve the case management practice.\nIn this work, we provide a mathematical model and a comprehensible formalism for reasoning about the meaning - the semantics - of case management process. We represent case management process as a finite state machine (FSM) and express its operational semantics in the Alloy specification language. The Alloy Analyzer tool allows us to define, simulate and validate a case management process model while efficiently managing its complexity. We illustrate our findings on the example of Mortgage Approval process.",
  "2012-R": "Until recently, efficiency gained through process automation and control was the main preoccupation of BPM practitioners. As a result, the majority of mainstream process modeling standards today is characterized by the imperative modeling style. This style encourages a modeler to commit to a well- determined process execution scenario already at the early design stages. For case management processes, however, a strict commitment to a predefined control flow is considered by organizations as a serious handicap. This is the main reason why case management as well as other knowledge-intensive processes in the organizations mostly remain “pen and paper”. In this article we demonstrate how configurable data objects and context-based configuration rules can be integrated into a process model in order to improve the process post-design adaptability and to pave the road for case management automated support. These concepts are defined as a part of DeCo (the Declarative Configurable process specification language). DeCo is a declarative modeling approach that is currently under development. We illustrate our results on the example.",
  "2011-RN": "Recent discussions raised by the BPM community illustrate the increasing demand of practitioners in the solutions for descriptive, knowledge-intensive processes. As a matter of fact, a majority of modeling formalisms presented on the market today fails in providing an appropriate level of adaptability while ensuring validation and control for such processes.\nIn this work we present a modeling approach based on Declarative Configurable specifications that capture the processes at three abstraction levels: design, deployment, and execution. As a result, DeCo allows for separation of the process goals from the process means and, finally, from the process realization details improving adaptability and control",
  "2011-RDN": "Business process modeling is a valuable technique helping organizations to specify their processes, to analyze their structure and to improve their performance. Conventional process modeling techniques are proven to be inefficient while dealing with non-repetitive, knowledge-intensive processes such as Case Management processes. In this work we use the MAP notation to model a Mortgage Approval Process as defined in Banking. To increase the navigability and practical value of map models, we extend the MAP notation with the concepts of Roles, Relations between roles, and Role Configuration Rules.",
  "2010-GRN": "Innovative Enterprise Architecture (EA) approaches developed by researchers and focused on the evaluation and the analysis of organizations usually require an extensive set of “measurable” input parameters. In practice, organizations often cannot provide the required data. This makes the implementation of these approaches difficult (if at all possible).\nIn this work we specify the build-up process that represents a systematic identification, gathering, and consolidation of data required by the target EA approach. We illustrate the build- up process on the example: We present a case study where we implement the research approach to business-IT fitness measurement in the context of a real industrial project in a mass retail company: Initially, the poor quality of the input data presented a serious threat for business-IT alignment assessment using the fitness measurements. After the input parameters have been built up, the applicability of the fitness measurements was significantly improved (from 10% to 90%) and alignment assessment was accomplished successfully.\nWe believe that using the build-up process it is possible to increase the applicability of any research approach in EA and, in spite of the initial absence of input measurable parameters, to deliver meaningful results to practitioners.",
  "2010-BPM": "The Case Management Process Modeling RFP released by OMG in 2009 expresses the particular demand of practitioners in the case management solutions. The case is defined as “A situation, set of circumstances or initiative that requires a set of actions to achieve an acceptable outcome or objective.” In this paper we consider an example of the case management process - the mortgage approval process. We formulate 5 challenges encountered while modeling this process using a traditional, activity-oriented modeling formalism, i.e. BPMN. We argue that the research methodologies developed during the past decade can be successfully applied to case management modeling. We propose the use of declarative specifications, variability modeling, and FOL-based semantics for modeling descriptive processes and, in particular, case management processes. We assemble these theoretical concepts in the form of DeCo process specifications that extend the BPMN notation.",
  "2010-BATI": "Approaches for business-IT alignment assessment developed in the research community represent an increasing interest for practitioners as they offer an in-depth analysis of the business and IT systems in the organisations. In order to be used by practitioners as a regular tool, these approaches have to be validated. Our experience shows that the perception of validity in academia - \"in vitro\" - and in the industrial environment - \"in vivo\" – may differ substantially. In this paper, we discuss the theoretical and empirical (or practical) validity of alignment assessment approaches based on metrics. We propose an empirical validation of a fitness measurement approach for business-IT alignment. First we identify a set of practical validity criteria for this approach and then we generalise our example proposing a set of practical guidelines for operationalisation of approaches based on alignment measurements. Our study reveals a significant gap between our understanding of validity and the perception of our industrial partners about this validity. The contribution of this work is a set of empirical criteria of validity and a set of practical guidelines that can significantly improve the usability – by organisations – of research approaches for business-IT alignment assessment."
}